diff --git a/202504/64/arm64/source-based/libvulkan.so.lsdump b/202504/64/arm64/source-based/libvulkan.so.lsdump
index 6a5f59455edfa1db52fb936d2ccbf36e964d5181..ea46cd36ddab580c90818b7e39b9bf3dd17da505 100644
--- a/202504/64/arm64/source-based/libvulkan.so.lsdump
+++ b/202504/64/arm64/source-based/libvulkan.so.lsdump
@@ -9,6 +9,14 @@
    "size" : 10,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std.h"
   },
+  {
+   "alignment" : 1,
+   "linker_set_key" : "_ZTIA128_c",
+   "name" : "char[128]",
+   "referenced_type" : "_ZTIc",
+   "size" : 128,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 2,
    "linker_set_key" : "_ZTIA128_t",
@@ -265,6 +273,14 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIA3_f",
+   "name" : "float[3]",
+   "referenced_type" : "_ZTIf",
+   "size" : 12,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 1,
    "linker_set_key" : "_ZTIA3_h",
@@ -273,6 +289,14 @@
    "size" : 3,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_h264std_encode.h"
   },
+  {
+   "alignment" : 4,
+   "linker_set_key" : "_ZTIA3_i",
+   "name" : "int[3]",
+   "referenced_type" : "_ZTIi",
+   "size" : 12,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {

    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_h265std.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK35VkDescriptorSetAndBindingMappingEXT",
+   "name" : "const VkDescriptorSetAndBindingMappingEXT",
+   "referenced_type" : "_ZTI35VkDescriptorSetAndBindingMappingEXT",
+   "size" : 96,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -30427,6 +34388,15 @@
    "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK35VkIndirectExecutionSetShaderInfoEXT",
+   "name" : "const VkIndirectExecutionSetShaderInfoEXT",
+   "referenced_type" : "_ZTI35VkIndirectExecutionSetShaderInfoEXT",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "is_const" : true,
@@ -30571,6 +34541,24 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK37VkIndirectCommandsIndexBufferTokenEXT",
+   "name" : "const VkIndirectCommandsIndexBufferTokenEXT",
+   "referenced_type" : "_ZTI37VkIndirectCommandsIndexBufferTokenEXT",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK37VkIndirectExecutionSetPipelineInfoEXT",
+   "name" : "const VkIndirectExecutionSetPipelineInfoEXT",
+   "referenced_type" : "_ZTI37VkIndirectExecutionSetPipelineInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -30607,6 +34595,33 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK38VkIndirectCommandsExecutionSetTokenEXT",
+   "name" : "const VkIndirectCommandsExecutionSetTokenEXT",
+   "referenced_type" : "_ZTI38VkIndirectCommandsExecutionSetTokenEXT",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK38VkIndirectCommandsPushConstantTokenEXT",
+   "name" : "const VkIndirectCommandsPushConstantTokenEXT",
+   "referenced_type" : "_ZTI38VkIndirectCommandsPushConstantTokenEXT",
+   "size" : 12,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK38VkIndirectCommandsVertexBufferTokenEXT",
+   "name" : "const VkIndirectCommandsVertexBufferTokenEXT",
+   "referenced_type" : "_ZTI38VkIndirectCommandsVertexBufferTokenEXT",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -30652,6 +34667,15 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK41VkIndirectExecutionSetShaderLayoutInfoEXT",
+   "name" : "const VkIndirectExecutionSetShaderLayoutInfoEXT",
+   "referenced_type" : "_ZTI41VkIndirectExecutionSetShaderLayoutInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -30670,6 +34694,15 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_android.h"
   },
+  {
+   "alignment" : 4,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIK44VkPhysicalDeviceDataGraphOperationSupportARM",
+   "name" : "const VkPhysicalDeviceDataGraphOperationSupportARM",
+   "referenced_type" : "_ZTI44VkPhysicalDeviceDataGraphOperationSupportARM",
+   "size" : 136,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -30769,6 +34802,24 @@
    "size" : 8,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKP13VkShaderEXT_T",
+   "name" : "VkShaderEXT_T *const",
+   "referenced_type" : "_ZTIP13VkShaderEXT_T",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKP13VkTensorARM_T",
+   "name" : "VkTensorARM_T *const",
+   "referenced_type" : "_ZTIP13VkTensorARM_T",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -30814,6 +34865,15 @@
    "size" : 8,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKP17VkTensorViewARM_T",
+   "name" : "VkTensorViewARM_T *const",
+   "referenced_type" : "_ZTIP17VkTensorViewARM_T",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -30967,6 +35027,15 @@
    "size" : 4,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "is_const" : true,
+   "linker_set_key" : "_ZTIKl",
+   "name" : "const long",
+   "referenced_type" : "_ZTIl",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "is_const" : true,
@@ -31893,6 +35962,35 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "swapchainCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pPresentIds",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKm"
+    }
+   ],
+   "linker_set_key" : "_ZTI15VkPresentId2KHR",
+   "name" : "VkPresentId2KHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -31952,6 +36050,45 @@
    "size" : 72,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "dimensionCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pSrcOffset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKm"
+    },
+    {
+     "field_name" : "pDstOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPKm"
+    },
+    {
+     "field_name" : "pExtent",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPKm"
+    }
+   ],
+   "linker_set_key" : "_ZTI15VkTensorCopyARM",
+   "name" : "VkTensorCopyARM",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -32543,6 +36680,40 @@
    "size" : 16,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "heapRange",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI23VkDeviceAddressRangeEXT"
+    },
+    {
+     "field_name" : "reservedRangeOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "reservedRangeSize",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI17VkBindHeapInfoEXT",
+   "name" : "VkBindHeapInfoEXT",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -32995,6 +37166,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "offset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "data",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI26VkHostAddressRangeConstEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI17VkPushDataInfoEXT",
+   "name" : "VkPushDataInfoEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -33247,69 +37447,24 @@
      "referenced_type" : "_ZTIPKv"
     },
     {
-     "field_name" : "function",
+     "field_name" : "depthBiasConstantFactor",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIP18VkCudaFunctionNV_T"
-    },
-    {
-     "field_name" : "gridDimX",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "gridDimY",
-     "field_offset" : 224,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "gridDimZ",
-     "field_offset" : 256,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "blockDimX",
-     "field_offset" : 288,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "blockDimY",
-     "field_offset" : 320,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "blockDimZ",
-     "field_offset" : 352,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "sharedMemBytes",
-     "field_offset" : 384,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "paramCount",
-     "field_offset" : 448,
-     "referenced_type" : "_ZTIm"
-    },
-    {
-     "field_name" : "pParams",
-     "field_offset" : 512,
-     "referenced_type" : "_ZTIPKPKv"
+     "referenced_type" : "_ZTIf"
     },
     {
-     "field_name" : "extraCount",
-     "field_offset" : 576,
-     "referenced_type" : "_ZTIm"
+     "field_name" : "depthBiasClamp",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIf"
     },
     {
-     "field_name" : "pExtras",
-     "field_offset" : 640,
-     "referenced_type" : "_ZTIPKPKv"
+     "field_name" : "depthBiasSlopeFactor",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIf"
     }
    ],
-   "linker_set_key" : "_ZTI18VkCudaLaunchInfoNV",
-   "name" : "VkCudaLaunchInfoNV",
-   "size" : 88,
+   "linker_set_key" : "_ZTI18VkDepthBiasInfoEXT",
+   "name" : "VkDepthBiasInfoEXT",
+   "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -33326,83 +37481,49 @@
      "referenced_type" : "_ZTIPKv"
     },
     {
-     "field_name" : "depthBiasConstantFactor",
+     "field_name" : "flags",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIf"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "depthBiasClamp",
+     "field_name" : "queueCreateInfoCount",
      "field_offset" : 160,
-     "referenced_type" : "_ZTIf"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "depthBiasSlopeFactor",
+     "field_name" : "pQueueCreateInfos",
      "field_offset" : 192,
-     "referenced_type" : "_ZTIf"
+     "referenced_type" : "_ZTIPK23VkDeviceQueueCreateInfo"
+    },
+    {
+     "field_name" : "enabledLayerCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ppEnabledLayerNames",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPKPKc"
+    },
+    {
+     "field_name" : "enabledExtensionCount",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "ppEnabledExtensionNames",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIPKPKc"
+    },
+    {
+     "field_name" : "pEnabledFeatures",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIPK24VkPhysicalDeviceFeatures"
     }
    ],
-   "linker_set_key" : "_ZTI18VkDepthBiasInfoEXT",
-   "name" : "VkDepthBiasInfoEXT",
-   "size" : 32,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
-    {
-     "field_name" : "sType",
-     "referenced_type" : "_ZTI15VkStructureType"
-    },
-    {
-     "field_name" : "pNext",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIPKv"
-    },
-    {
-     "field_name" : "flags",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "queueCreateInfoCount",
-     "field_offset" : 160,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "pQueueCreateInfos",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIPK23VkDeviceQueueCreateInfo"
-    },
-    {
-     "field_name" : "enabledLayerCount",
-     "field_offset" : 256,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "ppEnabledLayerNames",
-     "field_offset" : 320,
-     "referenced_type" : "_ZTIPKPKc"
-    },
-    {
-     "field_name" : "enabledExtensionCount",
-     "field_offset" : 384,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "ppEnabledExtensionNames",
-     "field_offset" : 448,
-     "referenced_type" : "_ZTIPKPKc"
-    },
-    {
-     "field_name" : "pEnabledFeatures",
-     "field_offset" : 512,
-     "referenced_type" : "_ZTIPK24VkPhysicalDeviceFeatures"
-    }
-   ],
-   "linker_set_key" : "_ZTI18VkDeviceCreateInfo",
-   "name" : "VkDeviceCreateInfo",
-   "size" : 72,
+   "linker_set_key" : "_ZTI18VkDeviceCreateInfo",
+   "name" : "VkDeviceCreateInfo",
+   "size" : 72,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -33832,6 +37953,45 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "srcTensor",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    },
+    {
+     "field_name" : "dstTensor",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    },
+    {
+     "field_name" : "regionCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pRegions",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPK15VkTensorCopyARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI19VkCopyTensorInfoARM",
+   "name" : "VkCopyTensorInfoARM",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -35541,6 +39701,25 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "minDepthClamp",
+     "referenced_type" : "_ZTIf"
+    },
+    {
+     "field_name" : "maxDepthClamp",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIf"
+    }
+   ],
+   "linker_set_key" : "_ZTI20VkDepthClampRangeEXT",
+   "name" : "VkDepthClampRangeEXT",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -35842,6 +40021,54 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    }
+   ],
+   "linker_set_key" : "_ZTI20VkPerTileEndInfoQCOM",
+   "name" : "VkPerTileEndInfoQCOM",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "numFramesPerBatch",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "presentConfigFeedback",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI20VkSetPresentConfigNV",
+   "name" : "VkSetPresentConfigNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -36364,6 +40591,50 @@
    "size" : 16,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTI26StdVideoVP9LoopFilterFlags"
+    },
+    {
+     "field_name" : "loop_filter_level",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "loop_filter_sharpness",
+     "field_offset" : 40,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "update_ref_delta",
+     "field_offset" : 48,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "loop_filter_ref_deltas",
+     "field_offset" : 56,
+     "referenced_type" : "_ZTIA4_a"
+    },
+    {
+     "field_name" : "update_mode_delta",
+     "field_offset" : 88,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "loop_filter_mode_deltas",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIA2_a"
+    }
+   ],
+   "linker_set_key" : "_ZTI21StdVideoVP9LoopFilter",
+   "name" : "StdVideoVP9LoopFilter",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -36738,6 +41009,25 @@
    "size" : 96,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "address",
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI21VkHostAddressRangeEXT",
+   "name" : "VkHostAddressRangeEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -36904,6 +41194,54 @@
    "size" : 8,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "stage",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "time",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI21VkPresentStageTimeEXT",
+   "name" : "VkPresentStageTimeEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "presentId",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "timeout",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI21VkPresentWait2InfoKHR",
+   "name" : "VkPresentWait2InfoKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -37011,6 +41349,25 @@
    "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    }
+   ],
+   "linker_set_key" : "_ZTI21VkRenderingEndInfoKHR",
+   "name" : "VkRenderingEndInfoKHR",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -37256,6 +41613,50 @@
    "size" : 88,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "pDescription",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK22VkTensorDescriptionARM"
+    },
+    {
+     "field_name" : "sharingMode",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI13VkSharingMode"
+    },
+    {
+     "field_name" : "queueFamilyIndexCount",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pQueueFamilyIndices",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPKj"
+    }
+   ],
+   "linker_set_key" : "_ZTI21VkTensorCreateInfoARM",
+   "name" : "VkTensorCreateInfoARM",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -37349,6 +41750,45 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTI27StdVideoVP9ColorConfigFlags"
+    },
+    {
+     "field_name" : "BitDepth",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "subsampling_x",
+     "field_offset" : 40,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "subsampling_y",
+     "field_offset" : 48,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "reserved1",
+     "field_offset" : 56,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "color_space",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTI21StdVideoVP9ColorSpace"
+    }
+   ],
+   "linker_set_key" : "_ZTI22StdVideoVP9ColorConfig",
+   "name" : "StdVideoVP9ColorConfig",
+   "size" : 12,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -37666,6 +42106,25 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    }
+   ],
+   "linker_set_key" : "_ZTI22VkDispatchTileInfoQCOM",
+   "name" : "VkDispatchTileInfoQCOM",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -37852,6 +42311,25 @@
    "size" : 96,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    }
+   ],
+   "linker_set_key" : "_ZTI22VkPerTileBeginInfoQCOM",
+   "name" : "VkPerTileBeginInfoQCOM",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -38420,6 +42898,50 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "targetTime",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "timeDomainId",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "presentStageQueries",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "targetTimeDomainPresentStage",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI22VkPresentTimingInfoEXT",
+   "name" : "VkPresentTimingInfoEXT",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -38493,6 +43015,55 @@
    "size" : 16,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tiling",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI17VkTensorTilingARM"
+    },
+    {
+     "field_name" : "format",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI8VkFormat"
+    },
+    {
+     "field_name" : "dimensionCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pDimensions",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPKl"
+    },
+    {
+     "field_name" : "pStrides",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPKl"
+    },
+    {
+     "field_name" : "usage",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI22VkTensorDescriptionARM",
+   "name" : "VkTensorDescriptionARM",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -38930,6 +43501,40 @@
    "size" : 4,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_h265std.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTI28StdVideoVP9SegmentationFlags"
+    },
+    {
+     "field_name" : "segmentation_tree_probs",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIA7_h"
+    },
+    {
+     "field_name" : "segmentation_pred_prob",
+     "field_offset" : 88,
+     "referenced_type" : "_ZTIA3_h"
+    },
+    {
+     "field_name" : "FeatureEnabled",
+     "field_offset" : 112,
+     "referenced_type" : "_ZTIA8_h"
+    },
+    {
+     "field_name" : "FeatureData",
+     "field_offset" : 176,
+     "referenced_type" : "_ZTIA8_A4_s"
+    }
+   ],
+   "linker_set_key" : "_ZTI23StdVideoVP9Segmentation",
+   "name" : "StdVideoVP9Segmentation",
+   "size" : 88,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -39203,6 +43808,25 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "address",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI23VkDeviceAddressRangeEXT",
+   "name" : "VkDeviceAddressRangeEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -39621,6 +44245,30 @@
    "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "counterID",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI23VkPerformanceCounterARM",
+   "name" : "VkPerformanceCounterARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -39746,6 +44394,35 @@
    "size" : 16,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "swapchainCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pTimingInfos",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK22VkPresentTimingInfoEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI23VkPresentTimingsInfoEXT",
+   "name" : "VkPresentTimingsInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -39970,8 +44647,8 @@
      "referenced_type" : "_ZTI16VkPresentModeKHR"
     }
    ],
-   "linker_set_key" : "_ZTI23VkSurfacePresentModeEXT",
-   "name" : "VkSurfacePresentModeEXT",
+   "linker_set_key" : "_ZTI23VkSurfacePresentModeKHR",
+   "name" : "VkSurfacePresentModeKHR",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -40431,35 +45108,6 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
-    {
-     "field_name" : "sType",
-     "referenced_type" : "_ZTI15VkStructureType"
-    },
-    {
-     "field_name" : "pNext",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIPKv"
-    },
-    {
-     "field_name" : "dataSize",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTIm"
-    },
-    {
-     "field_name" : "pData",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIPKv"
-    }
-   ],
-   "linker_set_key" : "_ZTI24VkCudaModuleCreateInfoNV",
-   "name" : "VkCudaModuleCreateInfoNV",
-   "size" : 32,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
   {
    "alignment" : 8,
    "fields" :
@@ -40508,6 +45156,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pView",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK21VkImageViewCreateInfo"
+    },
+    {
+     "field_name" : "layout",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI13VkImageLayout"
+    }
+   ],
+   "linker_set_key" : "_ZTI24VkImageDescriptorInfoEXT",
+   "name" : "VkImageDescriptorInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -40990,6 +45667,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "bank",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI24VkPushConstantBankInfoNV",
+   "name" : "VkPushConstantBankInfoNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -41174,6 +45875,25 @@
    "size" : 16,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "startAddress",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "strideInBytes",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI24VkStridedDeviceAddressNV",
+   "name" : "VkStridedDeviceAddressNV",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -41332,6 +46052,108 @@
    "size" : 104,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "srcStageMask",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "srcAccessMask",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstStageMask",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstAccessMask",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "srcQueueFamilyIndex",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dstQueueFamilyIndex",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tensor",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI24VkTensorMemoryBarrierARM",
+   "name" : "VkTensorMemoryBarrierARM",
+   "size" : 64,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "memory",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP16VkDeviceMemory_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI24VkTileMemoryBindInfoQCOM",
+   "name" : "VkTileMemoryBindInfoQCOM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI24VkTileMemorySizeInfoQCOM",
+   "name" : "VkTileMemorySizeInfoQCOM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -41647,6 +46469,40 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensor",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    },
+    {
+     "field_name" : "memory",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP16VkDeviceMemory_T"
+    },
+    {
+     "field_name" : "memoryOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI25VkBindTensorMemoryInfoARM",
+   "name" : "VkBindTensorMemoryInfoARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -41729,6 +46585,40 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "decompressionMethod",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "regionCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pRegions",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPK27VkDecompressMemoryRegionEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI25VkDecompressMemoryInfoEXT",
+   "name" : "VkDecompressMemoryInfoEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -41787,6 +46677,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensorCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pTensors",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKP13VkTensorARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI25VkFrameBoundaryTensorsARM",
+   "name" : "VkFrameBoundaryTensorsARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -42065,6 +46984,40 @@
    "size" : 72,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "resolveMode",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI21VkResolveModeFlagBits"
+    },
+    {
+     "field_name" : "stencilResolveMode",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI21VkResolveModeFlagBits"
+    }
+   ],
+   "linker_set_key" : "_ZTI25VkResolveImageModeInfoKHR",
+   "name" : "VkResolveImageModeInfoKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -42236,6 +47189,69 @@
    "size" : 72,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensorMemoryBarrierCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pTensorMemoryBarriers",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK24VkTensorMemoryBarrierARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI25VkTensorDependencyInfoARM",
+   "name" : "VkTensorDependencyInfoARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "tensor",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    },
+    {
+     "field_name" : "format",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI8VkFormat"
+    }
+   ],
+   "linker_set_key" : "_ZTI25VkTensorViewCreateInfoARM",
+   "name" : "VkTensorViewCreateInfoARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -42304,6 +47320,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "intraQIndex",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "predictiveQIndex",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "bipredictiveQIndex",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI25VkVideoEncodeAV1QIndexKHR",
+   "name" : "VkVideoEncodeAV1QIndexKHR",
+   "size" : 12,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -42473,6 +47513,36 @@
    "size" : 4,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "bit_width" : 1,
+     "field_name" : "loop_filter_delta_enabled",
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "loop_filter_delta_update",
+     "field_offset" : 1,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 30,
+     "field_name" : "reserved",
+     "field_offset" : 2,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI26StdVideoVP9LoopFilterFlags",
+   "name" : "StdVideoVP9LoopFilterFlags",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -42511,19 +47581,14 @@
      "referenced_type" : "_ZTIPKv"
     },
     {
-     "field_name" : "module",
+     "field_name" : "dataGraphPipeline",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIP16VkCudaModuleNV_T"
-    },
-    {
-     "field_name" : "pName",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIPKc"
+     "referenced_type" : "_ZTIP12VkPipeline_T"
     }
    ],
-   "linker_set_key" : "_ZTI26VkCudaFunctionCreateInfoNV",
-   "name" : "VkCudaFunctionCreateInfoNV",
-   "size" : 32,
+   "linker_set_key" : "_ZTI26VkDataGraphPipelineInfoARM",
+   "name" : "VkDataGraphPipelineInfoARM",
+   "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -42825,6 +47890,94 @@
    "size" : 12,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "shaderStages",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "indirectExecutionSet",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP27VkIndirectExecutionSetEXT_T"
+    },
+    {
+     "field_name" : "indirectCommandsLayout",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIP29VkIndirectCommandsLayoutEXT_T"
+    },
+    {
+     "field_name" : "indirectAddress",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "indirectAddressSize",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "preprocessAddress",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "preprocessSize",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxSequenceCount",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "sequenceCountAddress",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxDrawCount",
+     "field_offset" : 704,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI26VkGeneratedCommandsInfoEXT",
+   "name" : "VkGeneratedCommandsInfoEXT",
+   "size" : 96,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "address",
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI26VkHostAddressRangeConstEXT",
+   "name" : "VkHostAddressRangeConstEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -43223,6 +48376,48 @@
    "size" : 4,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "bit_width" : 1,
+     "field_name" : "color_range",
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 31,
+     "field_name" : "reserved",
+     "field_offset" : 1,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI27StdVideoVP9ColorConfigFlags",
+   "name" : "StdVideoVP9ColorConfigFlags",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    }
+   ],
+   "linker_set_key" : "_ZTI27VkBeginCustomResolveInfoEXT",
+   "name" : "VkBeginCustomResolveInfoEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -43330,6 +48525,74 @@
    "size" : 96,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "srcCopyFlags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dstCopyFlags",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "copyCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "copyAddressRange",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI30VkStridedDeviceAddressRangeKHR"
+    }
+   ],
+   "linker_set_key" : "_ZTI27VkCopyMemoryIndirectInfoKHR",
+   "name" : "VkCopyMemoryIndirectInfoKHR",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "srcAddress",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstAddress",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "compressedSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "decompressedSize",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI27VkDecompressMemoryRegionEXT",
+   "name" : "VkDecompressMemoryRegionEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -43581,6 +48844,60 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentId",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "targetTime",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "presentStageCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pPresentStages",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIP21VkPresentStageTimeEXT"
+    },
+    {
+     "field_name" : "timeDomain",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTI15VkTimeDomainKHR"
+    },
+    {
+     "field_name" : "timeDomainId",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "reportComplete",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI27VkPastPresentationTimingEXT",
+   "name" : "VkPastPresentationTimingEXT",
+   "size" : 72,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -43713,6 +49030,62 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "pImage",
+     "referenced_type" : "_ZTIPK24VkImageDescriptorInfoEXT"
+    },
+    {
+     "field_name" : "pTexelBuffer",
+     "referenced_type" : "_ZTIPK30VkTexelBufferDescriptorInfoEXT"
+    },
+    {
+     "field_name" : "pAddressRange",
+     "referenced_type" : "_ZTIPK23VkDeviceAddressRangeEXT"
+    },
+    {
+     "field_name" : "pTensorARM",
+     "referenced_type" : "_ZTIPK25VkTensorViewCreateInfoARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI27VkResourceDescriptorDataEXT",
+   "name" : "VkResourceDescriptorDataEXT",
+   "record_kind" : "union",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "type",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI16VkDescriptorType"
+    },
+    {
+     "field_name" : "data",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI27VkResourceDescriptorDataEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI27VkResourceDescriptorInfoEXT",
+   "name" : "VkResourceDescriptorInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -43809,6 +49182,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "optimalTilingTensorFeatures",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "linearTilingTensorFeatures",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI27VkTensorFormatPropertiesARM",
+   "name" : "VkTensorFormatPropertiesARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -44085,6 +49487,249 @@
    "size" : 136,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_decode.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTI33StdVideoDecodeVP9PictureInfoFlags"
+    },
+    {
+     "field_name" : "profile",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTI18StdVideoVP9Profile"
+    },
+    {
+     "field_name" : "frame_type",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTI20StdVideoVP9FrameType"
+    },
+    {
+     "field_name" : "frame_context_idx",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "reset_frame_context",
+     "field_offset" : 104,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "refresh_frame_flags",
+     "field_offset" : 112,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "ref_frame_sign_bias_mask",
+     "field_offset" : 120,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "interpolation_filter",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI30StdVideoVP9InterpolationFilter"
+    },
+    {
+     "field_name" : "base_q_idx",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "delta_q_y_dc",
+     "field_offset" : 168,
+     "referenced_type" : "_ZTIa"
+    },
+    {
+     "field_name" : "delta_q_uv_dc",
+     "field_offset" : 176,
+     "referenced_type" : "_ZTIa"
+    },
+    {
+     "field_name" : "delta_q_uv_ac",
+     "field_offset" : 184,
+     "referenced_type" : "_ZTIa"
+    },
+    {
+     "field_name" : "tile_cols_log2",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "tile_rows_log2",
+     "field_offset" : 200,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "reserved1",
+     "field_offset" : 208,
+     "referenced_type" : "_ZTIA3_t"
+    },
+    {
+     "field_name" : "pColorConfig",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPK22StdVideoVP9ColorConfig"
+    },
+    {
+     "field_name" : "pLoopFilter",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPK21StdVideoVP9LoopFilter"
+    },
+    {
+     "field_name" : "pSegmentation",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIPK23StdVideoVP9Segmentation"
+    }
+   ],
+   "linker_set_key" : "_ZTI28StdVideoDecodeVP9PictureInfo",
+   "name" : "StdVideoDecodeVP9PictureInfo",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std_decode.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTI33StdVideoEncodeAV1PictureInfoFlags"
+    },
+    {
+     "field_name" : "frame_type",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTI20StdVideoAV1FrameType"
+    },
+    {
+     "field_name" : "frame_presentation_time",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "current_frame_id",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "order_hint",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "primary_ref_frame",
+     "field_offset" : 136,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "refresh_frame_flags",
+     "field_offset" : 144,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "coded_denom",
+     "field_offset" : 152,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "render_width_minus_1",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIt"
+    },
+    {
+     "field_name" : "render_height_minus_1",
+     "field_offset" : 176,
+     "referenced_type" : "_ZTIt"
+    },
+    {
+     "field_name" : "interpolation_filter",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI30StdVideoAV1InterpolationFilter"
+    },
+    {
+     "field_name" : "TxMode",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTI17StdVideoAV1TxMode"
+    },
+    {
+     "field_name" : "delta_q_res",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "delta_lf_res",
+     "field_offset" : 264,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "ref_order_hint",
+     "field_offset" : 272,
+     "referenced_type" : "_ZTIA8_h"
+    },
+    {
+     "field_name" : "ref_frame_idx",
+     "field_offset" : 336,
+     "referenced_type" : "_ZTIA7_a"
+    },
+    {
+     "field_name" : "reserved1",
+     "field_offset" : 392,
+     "referenced_type" : "_ZTIA3_h"
+    },
+    {
+     "field_name" : "delta_frame_id_minus_1",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTIA7_j"
+    },
+    {
+     "field_name" : "pTileInfo",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIPK19StdVideoAV1TileInfo"
+    },
+    {
+     "field_name" : "pQuantization",
+     "field_offset" : 704,
+     "referenced_type" : "_ZTIPK23StdVideoAV1Quantization"
+    },
+    {
+     "field_name" : "pSegmentation",
+     "field_offset" : 768,
+     "referenced_type" : "_ZTIPK23StdVideoAV1Segmentation"
+    },
+    {
+     "field_name" : "pLoopFilter",
+     "field_offset" : 832,
+     "referenced_type" : "_ZTIPK21StdVideoAV1LoopFilter"
+    },
+    {
+     "field_name" : "pCDEF",
+     "field_offset" : 896,
+     "referenced_type" : "_ZTIPK15StdVideoAV1CDEF"
+    },
+    {
+     "field_name" : "pLoopRestoration",
+     "field_offset" : 960,
+     "referenced_type" : "_ZTIPK26StdVideoAV1LoopRestoration"
+    },
+    {
+     "field_name" : "pGlobalMotion",
+     "field_offset" : 1024,
+     "referenced_type" : "_ZTIPK23StdVideoAV1GlobalMotion"
+    },
+    {
+     "field_name" : "pExtensionHeader",
+     "field_offset" : 1088,
+     "referenced_type" : "_ZTIPK32StdVideoEncodeAV1ExtensionHeader"
+    },
+    {
+     "field_name" : "pBufferRemovalTimes",
+     "field_offset" : 1152,
+     "referenced_type" : "_ZTIPKj"
+    }
+   ],
+   "linker_set_key" : "_ZTI28StdVideoEncodeAV1PictureInfo",
+   "name" : "StdVideoEncodeAV1PictureInfo",
+   "size" : 152,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -44109,6 +49754,50 @@
    "size" : 12,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_h265std.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_update_map",
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_temporal_update",
+     "field_offset" : 1,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_update_data",
+     "field_offset" : 2,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_abs_or_delta_update",
+     "field_offset" : 3,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 28,
+     "field_name" : "reserved",
+     "field_offset" : 4,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI28StdVideoVP9SegmentationFlags",
+   "name" : "StdVideoVP9SegmentationFlags",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -44162,6 +49851,50 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "customResolve",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "colorAttachmentCount",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pColorAttachmentFormats",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK8VkFormat"
+    },
+    {
+     "field_name" : "depthAttachmentFormat",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI8VkFormat"
+    },
+    {
+     "field_name" : "stencilAttachmentFormat",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTI8VkFormat"
+    }
+   ],
+   "linker_set_key" : "_ZTI28VkCustomResolveCreateInfoEXT",
+   "name" : "VkCustomResolveCreateInfoEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -44206,6 +49939,30 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensorView",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP17VkTensorViewARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI28VkDescriptorGetTensorInfoARM",
+   "name" : "VkDescriptorGetTensorInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -44696,6 +50453,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "alignment",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI28VkTileMemoryRequirementsQCOM",
+   "name" : "VkTileMemoryRequirementsQCOM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -44720,6 +50506,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "intraFrameSize",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "predictiveFrameSize",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "bipredictiveFrameSize",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI28VkVideoEncodeAV1FrameSizeKHR",
+   "name" : "VkVideoEncodeAV1FrameSizeKHR",
+   "size" : 12,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -45426,30 +51236,6 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
-    {
-     "field_name" : "srcAddress",
-     "referenced_type" : "_ZTIm"
-    },
-    {
-     "field_name" : "dstAddress",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIm"
-    },
-    {
-     "field_name" : "size",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTIm"
-    }
-   ],
-   "linker_set_key" : "_ZTI29VkCopyMemoryIndirectCommandNV",
-   "name" : "VkCopyMemoryIndirectCommandNV",
-   "size" : 24,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
   {
    "alignment" : 8,
    "fields" :
@@ -45815,6 +51601,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "externalMemoryProperties",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI26VkExternalMemoryProperties"
+    }
+   ],
+   "linker_set_key" : "_ZTI29VkExternalTensorPropertiesARM",
+   "name" : "VkExternalTensorPropertiesARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -45863,6 +51673,25 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "pPipelineInfo",
+     "referenced_type" : "_ZTIPK37VkIndirectExecutionSetPipelineInfoEXT"
+    },
+    {
+     "field_name" : "pShaderInfo",
+     "referenced_type" : "_ZTIPK35VkIndirectExecutionSetShaderInfoEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI29VkIndirectExecutionSetInfoEXT",
+   "name" : "VkIndirectExecutionSetInfoEXT",
+   "record_kind" : "union",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -45874,7 +51703,7 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPKv"
+     "referenced_type" : "_ZTIPv"
     },
     {
      "field_name" : "presentID",
@@ -46171,8 +52000,8 @@
      "referenced_type" : "_ZTIPK16VkPresentModeKHR"
     }
    ],
-   "linker_set_key" : "_ZTI29VkSwapchainPresentModeInfoEXT",
-   "name" : "VkSwapchainPresentModeInfoEXT",
+   "linker_set_key" : "_ZTI29VkSwapchainPresentModeInfoKHR",
+   "name" : "VkSwapchainPresentModeInfoKHR",
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -46326,6 +52155,35 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensorViewCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pTensorViews",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKP17VkTensorViewARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI29VkWriteDescriptorSetTensorARM",
+   "name" : "VkWriteDescriptorSetTensorARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -46509,6 +52367,45 @@
    "size" : 16,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_decode.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTI35StdVideoEncodeAV1ReferenceInfoFlags"
+    },
+    {
+     "field_name" : "RefFrameId",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "frame_type",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTI20StdVideoAV1FrameType"
+    },
+    {
+     "field_name" : "OrderHint",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "reserved1",
+     "field_offset" : 104,
+     "referenced_type" : "_ZTIA3_h"
+    },
+    {
+     "field_name" : "pExtensionHeader",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK32StdVideoEncodeAV1ExtensionHeader"
+    }
+   ],
+   "linker_set_key" : "_ZTI30StdVideoEncodeAV1ReferenceInfo",
+   "name" : "StdVideoEncodeAV1ReferenceInfo",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -46733,6 +52630,59 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "srcAddress",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstAddress",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkCopyMemoryIndirectCommandKHR",
+   "name" : "VkCopyMemoryIndirectCommandKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "id",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pConstantData",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKv"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkDataGraphPipelineConstantARM",
+   "name" : "VkDataGraphPipelineConstantARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -46892,6 +52842,33 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "pPushConstant",
+     "referenced_type" : "_ZTIPK38VkIndirectCommandsPushConstantTokenEXT"
+    },
+    {
+     "field_name" : "pVertexBuffer",
+     "referenced_type" : "_ZTIPK38VkIndirectCommandsVertexBufferTokenEXT"
+    },
+    {
+     "field_name" : "pIndexBuffer",
+     "referenced_type" : "_ZTIPK37VkIndirectCommandsIndexBufferTokenEXT"
+    },
+    {
+     "field_name" : "pExecutionSet",
+     "referenced_type" : "_ZTIPK38VkIndirectCommandsExecutionSetTokenEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkIndirectCommandsTokenDataEXT",
+   "name" : "VkIndirectCommandsTokenDataEXT",
+   "record_kind" : "union",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -46945,6 +52922,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "srcAccessMask3",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstAccessMask3",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkMemoryBarrierAccessFlags3KHR",
+   "name" : "VkMemoryBarrierAccessFlags3KHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -47327,6 +53333,30 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "address",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "stride",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkStridedDeviceAddressRangeKHR",
+   "name" : "VkStridedDeviceAddressRangeKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -47375,11 +53405,69 @@
      "referenced_type" : "_ZTIPKP9VkFence_T"
     }
    ],
-   "linker_set_key" : "_ZTI30VkSwapchainPresentFenceInfoEXT",
-   "name" : "VkSwapchainPresentFenceInfoEXT",
+   "linker_set_key" : "_ZTI30VkSwapchainPresentFenceInfoKHR",
+   "name" : "VkSwapchainPresentFenceInfoKHR",
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "refreshDuration",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "refreshInterval",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkSwapchainTimingPropertiesEXT",
+   "name" : "VkSwapchainTimingPropertiesEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "format",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI8VkFormat"
+    },
+    {
+     "field_name" : "addressRange",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI23VkDeviceAddressRangeEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkTexelBufferDescriptorInfoEXT",
+   "name" : "VkTexelBufferDescriptorInfoEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -47595,6 +53683,176 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pStdPictureInfo",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK28StdVideoDecodeVP9PictureInfo"
+    },
+    {
+     "field_name" : "referenceNameSlotIndices",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIA3_i"
+    },
+    {
+     "field_name" : "uncompressedHeaderOffset",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "compressedHeaderOffset",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tilesOffset",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkVideoDecodeVP9PictureInfoKHR",
+   "name" : "VkVideoDecodeVP9PictureInfoKHR",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "stdProfile",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI18StdVideoVP9Profile"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkVideoDecodeVP9ProfileInfoKHR",
+   "name" : "VkVideoDecodeVP9ProfileInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pStdReferenceInfo",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK30StdVideoEncodeAV1ReferenceInfo"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkVideoEncodeAV1DpbSlotInfoKHR",
+   "name" : "VkVideoEncodeAV1DpbSlotInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "predictionMode",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI33VkVideoEncodeAV1PredictionModeKHR"
+    },
+    {
+     "field_name" : "rateControlGroup",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI35VkVideoEncodeAV1RateControlGroupKHR"
+    },
+    {
+     "field_name" : "constantQIndex",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pStdPictureInfo",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPK28StdVideoEncodeAV1PictureInfo"
+    },
+    {
+     "field_name" : "referenceNameSlotIndices",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIA7_i"
+    },
+    {
+     "field_name" : "primaryReferenceCdfOnly",
+     "field_offset" : 544,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "generateObuExtensionHeader",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkVideoEncodeAV1PictureInfoKHR",
+   "name" : "VkVideoEncodeAV1PictureInfoKHR",
+   "size" : 80,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "stdProfile",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI18StdVideoAV1Profile"
+    }
+   ],
+   "linker_set_key" : "_ZTI30VkVideoEncodeAV1ProfileInfoKHR",
+   "name" : "VkVideoEncodeAV1ProfileInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -47969,6 +54227,30 @@
    "size" : 144,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_h265std.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "feedbackLoopEnable",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI31VkAttachmentFeedbackLoopInfoEXT",
+   "name" : "VkAttachmentFeedbackLoopInfoEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -48129,6 +54411,55 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "inputType",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "inputInterpretation",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "matrixInterpretation",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "biasInterpretation",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "resultType",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "transpose",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI31VkCooperativeVectorPropertiesNV",
+   "name" : "VkCooperativeVectorPropertiesNV",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -48294,6 +54625,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "hdmi3DSupported",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI31VkDisplayModeStereoPropertiesNV",
+   "name" : "VkDisplayModeStereoPropertiesNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -48342,6 +54697,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "dynamicMetadataSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "pDynamicMetadata",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKv"
+    }
+   ],
+   "linker_set_key" : "_ZTI31VkHdrVividDynamicMetadataHUAWEI",
+   "name" : "VkHdrVividDynamicMetadataHUAWEI",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -48547,6 +54931,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "swapchain",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP16VkSwapchainKHR_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI31VkPastPresentationTimingInfoEXT",
+   "name" : "VkPastPresentationTimingInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -48760,8 +55173,8 @@
      "referenced_type" : "_ZTIPKj"
     }
    ],
-   "linker_set_key" : "_ZTI31VkReleaseSwapchainImagesInfoEXT",
-   "name" : "VkReleaseSwapchainImagesInfoEXT",
+   "linker_set_key" : "_ZTI31VkReleaseSwapchainImagesInfoKHR",
+   "name" : "VkReleaseSwapchainImagesInfoKHR",
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -49171,6 +55584,169 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maxLevel",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI16StdVideoVP9Level"
+    }
+   ],
+   "linker_set_key" : "_ZTI31VkVideoDecodeVP9CapabilitiesKHR",
+   "name" : "VkVideoDecodeVP9CapabilitiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxLevel",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI16StdVideoAV1Level"
+    },
+    {
+     "field_name" : "codedPictureAlignment",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    },
+    {
+     "field_name" : "maxTiles",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    },
+    {
+     "field_name" : "minTileSize",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    },
+    {
+     "field_name" : "maxTileSize",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    },
+    {
+     "field_name" : "superblockSizes",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxSingleReferenceCount",
+     "field_offset" : 480,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "singleReferenceNameMask",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxUnidirectionalCompoundReferenceCount",
+     "field_offset" : 544,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxUnidirectionalCompoundGroup1ReferenceCount",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "unidirectionalCompoundReferenceNameMask",
+     "field_offset" : 608,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxBidirectionalCompoundReferenceCount",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxBidirectionalCompoundGroup1ReferenceCount",
+     "field_offset" : 672,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxBidirectionalCompoundGroup2ReferenceCount",
+     "field_offset" : 704,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "bidirectionalCompoundReferenceNameMask",
+     "field_offset" : 736,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxTemporalLayerCount",
+     "field_offset" : 768,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxSpatialLayerCount",
+     "field_offset" : 800,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxOperatingPoints",
+     "field_offset" : 832,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "minQIndex",
+     "field_offset" : 864,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxQIndex",
+     "field_offset" : 896,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "prefersGopRemainingFrames",
+     "field_offset" : 928,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "requiresGopRemainingFrames",
+     "field_offset" : 960,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "stdSyntaxFlags",
+     "field_offset" : 992,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI31VkVideoEncodeAV1CapabilitiesKHR",
+   "name" : "VkVideoEncodeAV1CapabilitiesKHR",
+   "size" : 128,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -49389,6 +55965,25 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 1,
+   "fields" :
+   [
+    {
+     "field_name" : "temporal_id",
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "spatial_id",
+     "field_offset" : 8,
+     "referenced_type" : "_ZTIh"
+    }
+   ],
+   "linker_set_key" : "_ZTI32StdVideoEncodeAV1ExtensionHeader",
+   "name" : "StdVideoEncodeAV1ExtensionHeader",
+   "size" : 2,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -49830,6 +56425,45 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "layout",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP18VkPipelineLayout_T"
+    },
+    {
+     "field_name" : "resourceInfoCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pResourceInfos",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPK34VkDataGraphPipelineResourceInfoARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI32VkDataGraphPipelineCreateInfoARM",
+   "name" : "VkDataGraphPipelineCreateInfoARM",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -49888,6 +56522,61 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "constantOffset",
+     "referenced_type" : "_ZTI42VkDescriptorMappingSourceConstantOffsetEXT"
+    },
+    {
+     "field_name" : "pushIndex",
+     "referenced_type" : "_ZTI37VkDescriptorMappingSourcePushIndexEXT"
+    },
+    {
+     "field_name" : "indirectIndex",
+     "referenced_type" : "_ZTI41VkDescriptorMappingSourceIndirectIndexEXT"
+    },
+    {
+     "field_name" : "indirectIndexArray",
+     "referenced_type" : "_ZTI46VkDescriptorMappingSourceIndirectIndexArrayEXT"
+    },
+    {
+     "field_name" : "heapData",
+     "referenced_type" : "_ZTI36VkDescriptorMappingSourceHeapDataEXT"
+    },
+    {
+     "field_name" : "pushDataOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushAddressOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "indirectAddress",
+     "referenced_type" : "_ZTI43VkDescriptorMappingSourceIndirectAddressEXT"
+    },
+    {
+     "field_name" : "shaderRecordIndex",
+     "referenced_type" : "_ZTI45VkDescriptorMappingSourceShaderRecordIndexEXT"
+    },
+    {
+     "field_name" : "shaderRecordDataOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderRecordAddressOffset",
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI32VkDescriptorMappingSourceDataEXT",
+   "name" : "VkDescriptorMappingSourceDataEXT",
+   "record_kind" : "union",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -50067,6 +56756,35 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "shaderCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pShaders",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKP13VkShaderEXT_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI32VkGeneratedCommandsShaderInfoEXT",
+   "name" : "VkGeneratedCommandsShaderInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -50096,6 +56814,40 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "type",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI30VkIndirectCommandsTokenTypeEXT"
+    },
+    {
+     "field_name" : "data",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI30VkIndirectCommandsTokenDataEXT"
+    },
+    {
+     "field_name" : "offset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI32VkIndirectCommandsLayoutTokenEXT",
+   "name" : "VkIndirectCommandsLayoutTokenEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -50144,6 +56896,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pData",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK26VkHostAddressRangeConstEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI32VkOpaqueCaptureDataCreateInfoEXT",
+   "name" : "VkOpaqueCaptureDataCreateInfoEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -50971,11 +57747,16 @@
      "field_name" : "hostImageCopy",
      "field_offset" : 736,
      "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushDescriptor",
+     "field_offset" : 768,
+     "referenced_type" : "_ZTIj"
     }
    ],
    "linker_set_key" : "_ZTI32VkPhysicalDeviceVulkan14Features",
    "name" : "VkPhysicalDeviceVulkan14Features",
-   "size" : 96,
+   "size" : 104,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -51437,6 +58218,35 @@
    "size" : 88,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "intraRefreshCycleDuration",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "intraRefreshIndex",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI32VkVideoEncodeIntraRefreshInfoKHR",
+   "name" : "VkVideoEncodeIntraRefreshInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -51680,6 +58490,331 @@
    "size" : 4,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_decode.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "bit_width" : 1,
+     "field_name" : "error_resilient_mode",
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "intra_only",
+     "field_offset" : 1,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "allow_high_precision_mv",
+     "field_offset" : 2,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "refresh_frame_context",
+     "field_offset" : 3,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "frame_parallel_decoding_mode",
+     "field_offset" : 4,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_enabled",
+     "field_offset" : 5,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "show_frame",
+     "field_offset" : 6,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "UsePrevFrameMvs",
+     "field_offset" : 7,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 24,
+     "field_name" : "reserved",
+     "field_offset" : 8,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI33StdVideoDecodeVP9PictureInfoFlags",
+   "name" : "StdVideoDecodeVP9PictureInfoFlags",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_vp9std_decode.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "buffer_delay_length_minus_1",
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "buffer_removal_time_length_minus_1",
+     "field_offset" : 8,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "frame_presentation_time_length_minus_1",
+     "field_offset" : 16,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "reserved1",
+     "field_offset" : 24,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "num_units_in_decoding_tick",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI33StdVideoEncodeAV1DecoderModelInfo",
+   "name" : "StdVideoEncodeAV1DecoderModelInfo",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "bit_width" : 1,
+     "field_name" : "error_resilient_mode",
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "disable_cdf_update",
+     "field_offset" : 1,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "use_superres",
+     "field_offset" : 2,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "render_and_frame_size_different",
+     "field_offset" : 3,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "allow_screen_content_tools",
+     "field_offset" : 4,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "is_filter_switchable",
+     "field_offset" : 5,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "force_integer_mv",
+     "field_offset" : 6,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "frame_size_override_flag",
+     "field_offset" : 7,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "buffer_removal_time_present_flag",
+     "field_offset" : 8,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "allow_intrabc",
+     "field_offset" : 9,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "frame_refs_short_signaling",
+     "field_offset" : 10,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "allow_high_precision_mv",
+     "field_offset" : 11,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "is_motion_mode_switchable",
+     "field_offset" : 12,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "use_ref_frame_mvs",
+     "field_offset" : 13,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "disable_frame_end_update_cdf",
+     "field_offset" : 14,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "allow_warped_motion",
+     "field_offset" : 15,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "reduced_tx_set",
+     "field_offset" : 16,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "skip_mode_present",
+     "field_offset" : 17,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "delta_q_present",
+     "field_offset" : 18,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "delta_lf_present",
+     "field_offset" : 19,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "delta_lf_multi",
+     "field_offset" : 20,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_enabled",
+     "field_offset" : 21,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_update_map",
+     "field_offset" : 22,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_temporal_update",
+     "field_offset" : 23,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_update_data",
+     "field_offset" : 24,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "UsesLr",
+     "field_offset" : 25,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "usesChromaLr",
+     "field_offset" : 26,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "show_frame",
+     "field_offset" : 27,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "showable_frame",
+     "field_offset" : 28,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 3,
+     "field_name" : "reserved",
+     "field_offset" : 29,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI33StdVideoEncodeAV1PictureInfoFlags",
+   "name" : "StdVideoEncodeAV1PictureInfoFlags",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -52106,6 +59241,55 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "tensorNonPacked",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderTensorAccess",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderStorageTensorArrayDynamicIndexing",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderStorageTensorArrayNonUniformIndexing",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "descriptorBindingStorageTensorUpdateAfterBind",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tensors",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI33VkPhysicalDeviceTensorFeaturesARM",
+   "name" : "VkPhysicalDeviceTensorFeaturesARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -52321,6 +59505,30 @@
    "size" : 104,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI33VkRenderingAttachmentFlagsInfoKHR",
+   "name" : "VkRenderingAttachmentFlagsInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -52385,7 +59593,7 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPKv"
+     "referenced_type" : "_ZTIPv"
     },
     {
      "field_name" : "supportsProtected",
@@ -52398,6 +59606,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensor",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI33VkTensorMemoryRequirementsInfoARM",
+   "name" : "VkTensorMemoryRequirementsInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -52997,6 +60229,113 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "srcCopyFlags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "copyCount",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "copyAddressRange",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI30VkStridedDeviceAddressRangeKHR"
+    },
+    {
+     "field_name" : "dstImage",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIP9VkImage_T"
+    },
+    {
+     "field_name" : "dstImageLayout",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTI13VkImageLayout"
+    },
+    {
+     "field_name" : "pImageSubresources",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIPK24VkImageSubresourceLayers"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkCopyMemoryToImageIndirectInfoKHR",
+   "name" : "VkCopyMemoryToImageIndirectInfoKHR",
+   "size" : 72,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkDataGraphPipelineDispatchInfoARM",
+   "name" : "VkDataGraphPipelineDispatchInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "descriptorSet",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "binding",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "arrayElement",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkDataGraphPipelineResourceInfoARM",
+   "name" : "VkDataGraphPipelineResourceInfoARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -53075,6 +60414,78 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "stereoType",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI28VkDisplaySurfaceStereoTypeNV"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkDisplaySurfaceStereoCreateInfoNV",
+   "name" : "VkDisplaySurfaceStereoCreateInfoNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "preferredQueue",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP9VkQueue_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkExternalComputeQueueCreateInfoNV",
+   "name" : "VkExternalComputeQueueCreateInfoNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "deviceIndex",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkExternalComputeQueueDataParamsNV",
+   "name" : "VkExternalComputeQueueDataParamsNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -53104,6 +60515,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "pipeline",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP12VkPipeline_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkGeneratedCommandsPipelineInfoEXT",
+   "name" : "VkGeneratedCommandsPipelineInfoEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -53128,6 +60563,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "name",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIA256_c"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkPerformanceCounterDescriptionARM",
+   "name" : "VkPerformanceCounterDescriptionARM",
+   "size" : 280,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -54108,7 +61572,7 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
+     "referenced_type" : "_ZTIPKv"
     },
     {
      "field_name" : "transform",
@@ -54180,6 +61644,108 @@
    "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentId2Supported",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkSurfaceCapabilitiesPresentId2KHR",
+   "name" : "VkSurfaceCapabilitiesPresentId2KHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "timeDomainCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pTimeDomains",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP15VkTimeDomainKHR"
+    },
+    {
+     "field_name" : "pTimeDomainIds",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPm"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkSwapchainTimeDomainPropertiesEXT",
+   "name" : "VkSwapchainTimeDomainPropertiesEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "gopFrameCount",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "keyFramePeriod",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "consecutiveBipredictiveFrameCount",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "temporalLayerCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI34VkVideoEncodeAV1RateControlInfoKHR",
+   "name" : "VkVideoEncodeAV1RateControlInfoKHR",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -54210,6 +61776,80 @@
    "size" : 4,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_decode.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "flags",
+     "referenced_type" : "_ZTI40StdVideoEncodeAV1OperatingPointInfoFlags"
+    },
+    {
+     "field_name" : "operating_point_idc",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIt"
+    },
+    {
+     "field_name" : "seq_level_idx",
+     "field_offset" : 48,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "seq_tier",
+     "field_offset" : 56,
+     "referenced_type" : "_ZTIh"
+    },
+    {
+     "field_name" : "decoder_buffer_delay",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "encoder_buffer_delay",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "initial_display_delay_minus_1",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIh"
+    }
+   ],
+   "linker_set_key" : "_ZTI35StdVideoEncodeAV1OperatingPointInfo",
+   "name" : "StdVideoEncodeAV1OperatingPointInfo",
+   "size" : 20,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "bit_width" : 1,
+     "field_name" : "disable_frame_end_update_cdf",
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "segmentation_enabled",
+     "field_offset" : 1,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 30,
+     "field_name" : "reserved",
+     "field_offset" : 2,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI35StdVideoEncodeAV1ReferenceInfoFlags",
+   "name" : "StdVideoEncodeAV1ReferenceInfoFlags",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -54557,6 +62197,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_android.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "bufferAddress",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "indexType",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTI11VkIndexType"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkBindIndexBufferIndirectCommandEXT",
+   "name" : "VkBindIndexBufferIndirectCommandEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -54581,6 +62245,55 @@
    "size" : 16,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "descriptorSet",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "firstBinding",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "bindingCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "resourceMask",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "source",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI28VkDescriptorMappingSourceEXT"
+    },
+    {
+     "field_name" : "sourceData",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTI32VkDescriptorMappingSourceDataEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkDescriptorSetAndBindingMappingEXT",
+   "name" : "VkDescriptorSetAndBindingMappingEXT",
+   "size" : 96,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -54712,6 +62425,54 @@
    "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pCreateInfo",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK21VkTensorCreateInfoARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkDeviceTensorMemoryRequirementsARM",
+   "name" : "VkDeviceTensorMemoryRequirementsARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "handleTypes",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkExternalMemoryTensorCreateInfoARM",
+   "name" : "VkExternalMemoryTensorCreateInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -54736,6 +62497,84 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "type",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI33VkIndirectExecutionSetInfoTypeEXT"
+    },
+    {
+     "field_name" : "info",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI29VkIndirectExecutionSetInfoEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkIndirectExecutionSetCreateInfoEXT",
+   "name" : "VkIndirectExecutionSetCreateInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "shaderCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pInitialShaders",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKP13VkShaderEXT_T"
+    },
+    {
+     "field_name" : "pSetLayoutInfos",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPK41VkIndirectExecutionSetShaderLayoutInfoEXT"
+    },
+    {
+     "field_name" : "maxShaderCount",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushConstantRangeCount",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pPushConstantRanges",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIPK19VkPushConstantRange"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkIndirectExecutionSetShaderInfoEXT",
+   "name" : "VkIndirectExecutionSetShaderInfoEXT",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -54900,6 +62739,90 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maxTensorDimensionCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxTensorElements",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxPerDimensionTensorElements",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxTensorStride",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIl"
+    },
+    {
+     "field_name" : "maxTensorSize",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxTensorShaderAccessArrayLength",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxTensorShaderAccessSize",
+     "field_offset" : 480,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxDescriptorSetStorageTensors",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxPerStageDescriptorSetStorageTensors",
+     "field_offset" : 544,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxDescriptorSetUpdateAfterBindStorageTensors",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxPerStageDescriptorUpdateAfterBindStorageTensors",
+     "field_offset" : 608,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderStorageTensorArrayNonUniformIndexingNative",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderTensorSupportedStages",
+     "field_offset" : 672,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkPhysicalDeviceTensorPropertiesARM",
+   "name" : "VkPhysicalDeviceTensorPropertiesARM",
+   "size" : 88,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -55095,6 +63018,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "engine",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI44VkPhysicalDeviceDataGraphProcessingEngineARM"
+    },
+    {
+     "field_name" : "operation",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI44VkPhysicalDeviceDataGraphOperationSupportARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkQueueFamilyDataGraphPropertiesARM",
+   "name" : "VkQueueFamilyDataGraphPropertiesARM",
+   "size" : 160,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -55416,6 +63368,59 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "quantizationMap",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP13VkImageView_T"
+    },
+    {
+     "field_name" : "quantizationMapExtent",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkVideoEncodeQuantizationMapInfoKHR",
+   "name" : "VkVideoEncodeQuantizationMapInfoKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "dirtyIntraRefreshRegions",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI35VkVideoReferenceIntraRefreshInfoKHR",
+   "name" : "VkVideoReferenceIntraRefreshInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -55867,6 +63872,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "bufferAddress",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "size",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "stride",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkBindVertexBufferIndirectCommandEXT",
+   "name" : "VkBindVertexBufferIndirectCommandEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -55896,38 +63925,23 @@
    "fields" :
    [
     {
-     "field_name" : "srcAddress",
-     "referenced_type" : "_ZTIm"
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
     },
     {
-     "field_name" : "bufferRowLength",
+     "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "bufferImageHeight",
-     "field_offset" : 96,
-     "referenced_type" : "_ZTIj"
+     "referenced_type" : "_ZTIPKv"
     },
     {
-     "field_name" : "imageSubresource",
+     "field_name" : "use64bitTexturing",
      "field_offset" : 128,
-     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
-    },
-    {
-     "field_name" : "imageOffset",
-     "field_offset" : 256,
-     "referenced_type" : "_ZTI10VkOffset3D"
-    },
-    {
-     "field_name" : "imageExtent",
-     "field_offset" : 352,
-     "referenced_type" : "_ZTI10VkExtent3D"
+     "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI36VkCopyMemoryToImageIndirectCommandNV",
-   "name" : "VkCopyMemoryToImageIndirectCommandNV",
-   "size" : 56,
+   "linker_set_key" : "_ZTI36VkCuModuleTexturingModeCreateInfoNVX",
+   "name" : "VkCuModuleTexturingModeCreateInfoNVX",
+   "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -55999,6 +64013,25 @@
    "size" : 96,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "heapOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushOffset",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkDescriptorMappingSourceHeapDataEXT",
+   "name" : "VkDescriptorMappingSourceHeapDataEXT",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -56253,7 +64286,7 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPKv"
+     "referenced_type" : "_ZTIPv"
     },
     {
      "field_name" : "format",
@@ -56305,6 +64338,50 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "dataGraph",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dataGraphUpdateAfterBind",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dataGraphSpecializationConstants",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dataGraphDescriptorBuffer",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dataGraphShaderModule",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkPhysicalDeviceDataGraphFeaturesARM",
+   "name" : "VkPhysicalDeviceDataGraphFeaturesARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -56454,6 +64531,40 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "shaderFmaFloat16",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderFmaFloat32",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderFmaFloat64",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkPhysicalDeviceShaderFmaFeaturesKHR",
+   "name" : "VkPhysicalDeviceShaderFmaFeaturesKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -56683,6 +64794,54 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "subsampledImageDescriptorCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkSubsampledImageFormatPropertiesEXT",
+   "name" : "VkSubsampledImageFormatPropertiesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentWait2Supported",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkSurfaceCapabilitiesPresentWait2KHR",
+   "name" : "VkSurfaceCapabilitiesPresentWait2KHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -56707,8 +64866,8 @@
      "referenced_type" : "_ZTIP16VkPresentModeKHR"
     }
    ],
-   "linker_set_key" : "_ZTI36VkSurfacePresentModeCompatibilityEXT",
-   "name" : "VkSurfacePresentModeCompatibilityEXT",
+   "linker_set_key" : "_ZTI36VkSurfacePresentModeCompatibilityKHR",
+   "name" : "VkSurfacePresentModeCompatibilityKHR",
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -56736,11 +64895,64 @@
      "referenced_type" : "_ZTIPK16VkPresentModeKHR"
     }
    ],
-   "linker_set_key" : "_ZTI36VkSwapchainPresentModesCreateInfoEXT",
-   "name" : "VkSwapchainPresentModesCreateInfoEXT",
+   "linker_set_key" : "_ZTI36VkSwapchainPresentModesCreateInfoKHR",
+   "name" : "VkSwapchainPresentModesCreateInfoKHR",
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensor",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkTensorCaptureDescriptorDataInfoARM",
+   "name" : "VkTensorCaptureDescriptorDataInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "useMaxLevel",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxLevel",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI16StdVideoAV1Level"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkVideoEncodeAV1SessionCreateInfoKHR",
+   "name" : "VkVideoEncodeAV1SessionCreateInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -56780,6 +64992,35 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "index",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shader",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP13VkShaderEXT_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI36VkWriteIndirectExecutionSetShaderEXT",
+   "name" : "VkWriteIndirectExecutionSetShaderEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -56838,6 +65079,104 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "srcAddress",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "bufferRowLength",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "bufferImageHeight",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "imageSubresource",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI24VkImageSubresourceLayers"
+    },
+    {
+     "field_name" : "imageOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI10VkOffset3D"
+    },
+    {
+     "field_name" : "imageExtent",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTI10VkExtent3D"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkCopyMemoryToImageIndirectCommandKHR",
+   "name" : "VkCopyMemoryToImageIndirectCommandKHR",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "heapOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushOffset",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapIndexStride",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapArrayStride",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pEmbeddedSampler",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK19VkSamplerCreateInfo"
+    },
+    {
+     "field_name" : "useCombinedImageSamplerIndex",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapOffset",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerPushOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapIndexStride",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapArrayStride",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkDescriptorMappingSourcePushIndexEXT",
+   "name" : "VkDescriptorMappingSourcePushIndexEXT",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -56925,6 +65264,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "bufferAddress",
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "stride",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "commandCount",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkDrawIndirectCountIndirectCommandEXT",
+   "name" : "VkDrawIndirectCountIndirectCommandEXT",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57065,6 +65428,137 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "mode",
+     "referenced_type" : "_ZTI38VkIndirectCommandsInputModeFlagBitsEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkIndirectCommandsIndexBufferTokenEXT",
+   "name" : "VkIndirectCommandsIndexBufferTokenEXT",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderStages",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "indirectStride",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pipelineLayout",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIP18VkPipelineLayout_T"
+    },
+    {
+     "field_name" : "tokenCount",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pTokens",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIPK32VkIndirectCommandsLayoutTokenEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkIndirectCommandsLayoutCreateInfoEXT",
+   "name" : "VkIndirectCommandsLayoutCreateInfoEXT",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "initialPipeline",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP12VkPipeline_T"
+    },
+    {
+     "field_name" : "maxPipelineCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkIndirectExecutionSetPipelineInfoEXT",
+   "name" : "VkIndirectExecutionSetPipelineInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "timingPropertiesCounter",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "timeDomainsCounter",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "presentationTimingCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pPresentationTimings",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIP27VkPastPresentationTimingEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkPastPresentationTimingPropertiesEXT",
+   "name" : "VkPastPresentationTimingPropertiesEXT",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57113,6 +65607,64 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "pDescription",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK22VkTensorDescriptionARM"
+    },
+    {
+     "field_name" : "handleType",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI34VkExternalMemoryHandleTypeFlagBits"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkPhysicalDeviceExternalTensorInfoARM",
+   "name" : "VkPhysicalDeviceExternalTensorInfoARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "formatPack",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkPhysicalDeviceFormatPackFeaturesARM",
+   "name" : "VkPhysicalDeviceFormatPackFeaturesARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57205,6 +65757,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentId2",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkPhysicalDevicePresentId2FeaturesKHR",
+   "name" : "VkPhysicalDevicePresentId2FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57359,6 +65935,45 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentTimingSupported",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "presentAtAbsoluteTimeSupported",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "presentAtRelativeTimeSupported",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "presentStageQueries",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkPresentTimingSurfaceCapabilitiesEXT",
+   "name" : "VkPresentTimingSurfaceCapabilitiesEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57388,6 +66003,35 @@
    "size" : 88,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileApronSize",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkRenderPassTileShadingCreateInfoQCOM",
+   "name" : "VkRenderPassTileShadingCreateInfoQCOM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57460,6 +66104,40 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "swapchain",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP16VkSwapchainKHR_T"
+    },
+    {
+     "field_name" : "presentStage",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "timeDomainId",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI37VkSwapchainCalibratedTimestampInfoEXT",
+   "name" : "VkSwapchainCalibratedTimestampInfoEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57710,6 +66388,114 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "occupancyPriority",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIf"
+    },
+    {
+     "field_name" : "occupancyThrottling",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIf"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkComputeOccupancyPriorityParametersNV",
+   "name" : "VkComputeOccupancyPriorityParametersNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "srcSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "srcData",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI29VkDeviceOrHostAddressConstKHR"
+    },
+    {
+     "field_name" : "pDstSize",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPm"
+    },
+    {
+     "field_name" : "dstData",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTI24VkDeviceOrHostAddressKHR"
+    },
+    {
+     "field_name" : "srcComponentType",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "dstComponentType",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "numRows",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "numColumns",
+     "field_offset" : 480,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "srcLayout",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTI33VkCooperativeVectorMatrixLayoutNV"
+    },
+    {
+     "field_name" : "srcStride",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstLayout",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTI33VkCooperativeVectorMatrixLayoutNV"
+    },
+    {
+     "field_name" : "dstStride",
+     "field_offset" : 704,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkConvertCooperativeVectorMatrixInfoNV",
+   "name" : "VkConvertCooperativeVectorMatrixInfoNV",
+   "size" : 96,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57850,6 +66636,77 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "type",
+     "referenced_type" : "_ZTI33VkIndirectExecutionSetInfoTypeEXT"
+    },
+    {
+     "field_name" : "shaderStages",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkIndirectCommandsExecutionSetTokenEXT",
+   "name" : "VkIndirectCommandsExecutionSetTokenEXT",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "updateRange",
+     "referenced_type" : "_ZTI19VkPushConstantRange"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkIndirectCommandsPushConstantTokenEXT",
+   "name" : "VkIndirectCommandsPushConstantTokenEXT",
+   "size" : 12,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "vertexBindingUnit",
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkIndirectCommandsVertexBufferTokenEXT",
+   "name" : "VkIndirectCommandsVertexBufferTokenEXT",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensor",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP13VkTensorARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkMemoryDedicatedAllocateInfoTensorARM",
+   "name" : "VkMemoryDedicatedAllocateInfoTensorARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -57932,6 +66789,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "hdrVivid",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkPhysicalDeviceHdrVividFeaturesHUAWEI",
+   "name" : "VkPhysicalDeviceHdrVividFeaturesHUAWEI",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -58336,8 +67217,8 @@
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI38VkPhysicalDeviceRobustness2FeaturesEXT",
-   "name" : "VkPhysicalDeviceRobustness2FeaturesEXT",
+   "linker_set_key" : "_ZTI38VkPhysicalDeviceRobustness2FeaturesKHR",
+   "name" : "VkPhysicalDeviceRobustness2FeaturesKHR",
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -58585,8 +67466,8 @@
      "referenced_type" : "_ZTI10VkExtent2D"
     }
    ],
-   "linker_set_key" : "_ZTI38VkSurfacePresentScalingCapabilitiesEXT",
-   "name" : "VkSurfacePresentScalingCapabilitiesEXT",
+   "linker_set_key" : "_ZTI38VkSurfacePresentScalingCapabilitiesKHR",
+   "name" : "VkSurfacePresentScalingCapabilitiesKHR",
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -58619,8 +67500,8 @@
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI38VkSwapchainPresentScalingCreateInfoEXT",
-   "name" : "VkSwapchainPresentScalingCreateInfoEXT",
+   "linker_set_key" : "_ZTI38VkSwapchainPresentScalingCreateInfoKHR",
+   "name" : "VkSwapchainPresentScalingCreateInfoKHR",
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -58701,6 +67582,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "index",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pipeline",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP12VkPipeline_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI38VkWriteIndirectExecutionSetPipelineEXT",
+   "name" : "VkWriteIndirectExecutionSetPipelineEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -58769,6 +67679,29 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "pClustersBottomLevel",
+     "referenced_type" : "_ZTIP56VkClusterAccelerationStructureClustersBottomLevelInputNV"
+    },
+    {
+     "field_name" : "pTriangleClusters",
+     "referenced_type" : "_ZTIP52VkClusterAccelerationStructureTriangleClusterInputNV"
+    },
+    {
+     "field_name" : "pMoveObjects",
+     "referenced_type" : "_ZTIP48VkClusterAccelerationStructureMoveObjectsInputNV"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkClusterAccelerationStructureOpInputNV",
+   "name" : "VkClusterAccelerationStructureOpInputNV",
+   "record_kind" : "union",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -58823,6 +67756,35 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dataGraphPipeline",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP12VkPipeline_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkDataGraphPipelineSessionCreateInfoARM",
+   "name" : "VkDataGraphPipelineSessionCreateInfoARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -58905,6 +67867,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pushDataOffset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushDataSize",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkIndirectCommandsLayoutPushDataTokenNV",
+   "name" : "VkIndirectCommandsLayoutPushDataTokenNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -59169,6 +68160,54 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maintenance8",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkPhysicalDeviceMaintenance8FeaturesKHR",
+   "name" : "VkPhysicalDeviceMaintenance8FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maintenance9",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkPhysicalDeviceMaintenance9FeaturesKHR",
+   "name" : "VkPhysicalDeviceMaintenance9FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -59465,6 +68504,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentWait2",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkPhysicalDevicePresentWait2FeaturesKHR",
+   "name" : "VkPhysicalDevicePresentWait2FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -59612,6 +68675,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "shaderFloat8",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderFloat8CooperativeMatrix",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkPhysicalDeviceShaderFloat8FeaturesEXT",
+   "name" : "VkPhysicalDeviceShaderFloat8FeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -59636,6 +68728,95 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "tileShading",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingFragmentStage",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingColorAttachments",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingDepthAttachments",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingStencilAttachments",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingInputAttachments",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingSampledAttachments",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingPerTileDraw",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingPerTileDispatch",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingDispatchTile",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingApron",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingAnisotropicApron",
+     "field_offset" : 480,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingAtomicOps",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileShadingImageProcessing",
+     "field_offset" : 544,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkPhysicalDeviceTileShadingFeaturesQCOM",
+   "name" : "VkPhysicalDeviceTileShadingFeaturesQCOM",
+   "size" : 72,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -59767,6 +68948,92 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "useMinQIndex",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "minQIndex",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI25VkVideoEncodeAV1QIndexKHR"
+    },
+    {
+     "field_name" : "useMaxQIndex",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxQIndex",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTI25VkVideoEncodeAV1QIndexKHR"
+    },
+    {
+     "field_name" : "useMaxFrameSize",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxFrameSize",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTI28VkVideoEncodeAV1FrameSizeKHR"
+    }
+   ],
+   "linker_set_key" : "_ZTI39VkVideoEncodeAV1RateControlLayerInfoKHR",
+   "name" : "VkVideoEncodeAV1RateControlLayerInfoKHR",
+   "size" : 64,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "bit_width" : 1,
+     "field_name" : "decoder_model_present_for_this_op",
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "low_delay_mode_flag",
+     "field_offset" : 1,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 1,
+     "field_name" : "initial_display_delay_present_for_this_op",
+     "field_offset" : 2,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 29,
+     "field_name" : "reserved",
+     "field_offset" : 3,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI40StdVideoEncodeAV1OperatingPointInfoFlags",
+   "name" : "StdVideoEncodeAV1OperatingPointInfoFlags",
+   "size" : 4,
+   "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_av1std_encode.h"
+  },
   {
    "alignment" : 4,
    "fields" :
@@ -59807,7 +69074,7 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPKv"
+     "referenced_type" : "_ZTIPv"
     },
     {
      "field_name" : "accelerationStructureSize",
@@ -59859,6 +69126,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_android.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "processingEngineCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pProcessingEngines",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP44VkPhysicalDeviceDataGraphProcessingEngineARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkDataGraphProcessingEngineCreateInfoARM",
+   "name" : "VkDataGraphProcessingEngineCreateInfoARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -59883,6 +69179,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "reservedExternalQueues",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkExternalComputeQueueDeviceCreateInfoNV",
+   "name" : "VkExternalComputeQueueDeviceCreateInfoNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -59955,6 +69275,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "customResolve",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkPhysicalDeviceCustomResolveFeaturesEXT",
+   "name" : "VkPhysicalDeviceCustomResolveFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60003,6 +69347,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maintenance10",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkPhysicalDeviceMaintenance10FeaturesKHR",
+   "name" : "VkPhysicalDeviceMaintenance10FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60027,6 +69395,40 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentTiming",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "presentAtAbsoluteTime",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "presentAtRelativeTime",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkPhysicalDevicePresentTimingFeaturesEXT",
+   "name" : "VkPhysicalDevicePresentTimingFeaturesEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60075,8 +69477,8 @@
      "referenced_type" : "_ZTIm"
     }
    ],
-   "linker_set_key" : "_ZTI40VkPhysicalDeviceRobustness2PropertiesEXT",
-   "name" : "VkPhysicalDeviceRobustness2PropertiesEXT",
+   "linker_set_key" : "_ZTI40VkPhysicalDeviceRobustness2PropertiesKHR",
+   "name" : "VkPhysicalDeviceRobustness2PropertiesKHR",
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -60263,6 +69665,69 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "tensorView",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP17VkTensorViewARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkTensorViewCaptureDescriptorDataInfoARM",
+   "name" : "VkTensorViewCaptureDescriptorDataInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "useGopRemainingFrames",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "gopRemainingIntra",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "gopRemainingPredictive",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "gopRemainingBipredictive",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkVideoEncodeAV1GopRemainingFrameInfoKHR",
+   "name" : "VkVideoEncodeAV1GopRemainingFrameInfoKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60390,6 +69855,50 @@
    "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "intraRefreshModes",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxIntraRefreshCycleDuration",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxIntraRefreshActiveReferencePictures",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "partitionIndependentIntraRefreshRegions",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "nonRectangularIntraRefreshRegions",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI40VkVideoEncodeIntraRefreshCapabilitiesKHR",
+   "name" : "VkVideoEncodeIntraRefreshCapabilitiesKHR",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60574,6 +70083,89 @@
    "size" : 4,
    "source_file" : "external/vulkan-headers/include/vk_video/vulkan_video_codec_h265std_encode.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maxAccelerationStructureCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "opType",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI38VkClusterAccelerationStructureOpTypeNV"
+    },
+    {
+     "field_name" : "opMode",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTI38VkClusterAccelerationStructureOpModeNV"
+    },
+    {
+     "field_name" : "opInput",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI39VkClusterAccelerationStructureOpInputNV"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkClusterAccelerationStructureInputInfoNV",
+   "name" : "VkClusterAccelerationStructureInputInfoNV",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "property",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI30VkDataGraphPipelinePropertyARM"
+    },
+    {
+     "field_name" : "isText",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dataSize",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "pData",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPv"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkDataGraphPipelinePropertyQueryResultARM",
+   "name" : "VkDataGraphPipelinePropertyQueryResultARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60603,6 +70195,75 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "heapOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushOffset",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "addressOffset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapIndexStride",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapArrayStride",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pEmbeddedSampler",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK19VkSamplerCreateInfo"
+    },
+    {
+     "field_name" : "useCombinedImageSamplerIndex",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapOffset",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerPushOffset",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerAddressOffset",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapIndexStride",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapArrayStride",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkDescriptorMappingSourceIndirectIndexEXT",
+   "name" : "VkDescriptorMappingSourceIndirectIndexEXT",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60685,6 +70346,59 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "setLayoutCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pSetLayouts",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKP23VkDescriptorSetLayout_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkIndirectExecutionSetShaderLayoutInfoEXT",
+   "name" : "VkIndirectExecutionSetShaderLayoutInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "enablePartitionTranslation",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPartitionedAccelerationStructureFlagsNV",
+   "name" : "VkPartitionedAccelerationStructureFlagsNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60733,6 +70447,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "descriptorHeap",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "descriptorHeapCaptureReplay",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPhysicalDeviceDescriptorHeapFeaturesEXT",
+   "name" : "VkPhysicalDeviceDescriptorHeapFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60841,6 +70584,35 @@
    "size" : 48,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "image2DViewOf3DSparse",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "defaultVertexAttributeValue",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI32VkDefaultVertexAttributeValueKHR"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPhysicalDeviceMaintenance9PropertiesKHR",
+   "name" : "VkPhysicalDeviceMaintenance9PropertiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -60918,6 +70690,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentMetering",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPhysicalDevicePresentMeteringFeaturesNV",
+   "name" : "VkPhysicalDevicePresentMeteringFeaturesNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61019,6 +70815,40 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "shaderBFloat16Type",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderBFloat16DotProduct",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderBFloat16CooperativeMatrix",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPhysicalDeviceShaderBfloat16FeaturesKHR",
+   "name" : "VkPhysicalDeviceShaderBfloat16FeaturesKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61077,6 +70907,45 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maxApronSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferNonCoherent",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileGranularity",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    },
+    {
+     "field_name" : "maxTileShadingRate",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPhysicalDeviceTileShadingPropertiesQCOM",
+   "name" : "VkPhysicalDeviceTileShadingPropertiesQCOM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61101,6 +70970,54 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "videoDecodeVP9",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPhysicalDeviceVideoDecodeVP9FeaturesKHR",
+   "name" : "VkPhysicalDeviceVideoDecodeVP9FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "videoEncodeAV1",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPhysicalDeviceVideoEncodeAV1FeaturesKHR",
+   "name" : "VkPhysicalDeviceVideoEncodeAV1FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61135,6 +71052,40 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "headerSize",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "headerVersion",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTI28VkPipelineCacheHeaderVersion"
+    },
+    {
+     "field_name" : "cacheType",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTI29VkDataGraphModelCacheTypeQCOM"
+    },
+    {
+     "field_name" : "cacheVersion",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "toolchainVersion",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIA3_j"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkPipelineCacheHeaderVersionDataGraphQCOM",
+   "name" : "VkPipelineCacheHeaderVersionDataGraphQCOM",
+   "size" : 28,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61159,6 +71110,100 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "preferredRateControlFlags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredGopFrameCount",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredKeyFramePeriod",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredConsecutiveBipredictiveFrameCount",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredTemporalLayerCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredConstantQIndex",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTI25VkVideoEncodeAV1QIndexKHR"
+    },
+    {
+     "field_name" : "preferredMaxSingleReferenceCount",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredSingleReferenceNameMask",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredMaxUnidirectionalCompoundReferenceCount",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredMaxUnidirectionalCompoundGroup1ReferenceCount",
+     "field_offset" : 480,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredUnidirectionalCompoundReferenceNameMask",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredMaxBidirectionalCompoundReferenceCount",
+     "field_offset" : 544,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredMaxBidirectionalCompoundGroup1ReferenceCount",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredMaxBidirectionalCompoundGroup2ReferenceCount",
+     "field_offset" : 608,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "preferredBidirectionalCompoundReferenceNameMask",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkVideoEncodeAV1QualityLevelPropertiesKHR",
+   "name" : "VkVideoEncodeAV1QualityLevelPropertiesKHR",
+   "size" : 88,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61237,6 +71282,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "quantizationMapTexelSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    }
+   ],
+   "linker_set_key" : "_ZTI41VkVideoFormatQuantizationMapPropertiesKHR",
+   "name" : "VkVideoFormatQuantizationMapPropertiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61357,6 +71426,69 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "identifierSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pIdentifier",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKh"
+    }
+   ],
+   "linker_set_key" : "_ZTI42VkDataGraphPipelineIdentifierCreateInfoARM",
+   "name" : "VkDataGraphPipelineIdentifierCreateInfoARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "heapOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapArrayStride",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pEmbeddedSampler",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPK19VkSamplerCreateInfo"
+    },
+    {
+     "field_name" : "samplerHeapOffset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapArrayStride",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI42VkDescriptorMappingSourceConstantOffsetEXT",
+   "name" : "VkDescriptorMappingSourceConstantOffsetEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61487,13 +71619,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "cudaKernelLaunchFeatures",
+     "field_name" : "dataGraphModel",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI42VkPhysicalDeviceCudaKernelLaunchFeaturesNV",
-   "name" : "VkPhysicalDeviceCudaKernelLaunchFeaturesNV",
+   "linker_set_key" : "_ZTI42VkPhysicalDeviceDataGraphModelFeaturesQCOM",
+   "name" : "VkPhysicalDeviceDataGraphModelFeaturesQCOM",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -61770,6 +71902,40 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "rgba4OpaqueBlackSwizzled",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "resolveSrgbFormatAppliesTransferFunction",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "resolveSrgbFormatSupportsTransferFunctionControl",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI42VkPhysicalDeviceMaintenance10PropertiesKHR",
+   "name" : "VkPhysicalDeviceMaintenance10PropertiesKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -61891,6 +72057,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "pushConstantBank",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI42VkPhysicalDevicePushConstantBankFeaturesNV",
+   "name" : "VkPhysicalDevicePushConstantBankFeaturesNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -62026,6 +72216,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "tileMemoryHeap",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI42VkPhysicalDeviceTileMemoryHeapFeaturesQCOM",
+   "name" : "VkPhysicalDeviceTileMemoryHeapFeaturesQCOM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -62357,6 +72571,30 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "performEncodeRgbConversion",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI42VkVideoEncodeProfileRgbConversionInfoVALVE",
+   "name" : "VkVideoEncodeProfileRgbConversionInfoVALVE",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -62497,6 +72735,69 @@
    "size" : 144,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "session",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP31VkDataGraphPipelineSessionARM_T"
+    },
+    {
+     "field_name" : "bindPoint",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI38VkDataGraphPipelineSessionBindPointARM"
+    },
+    {
+     "field_name" : "objectIndex",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "memory",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIP16VkDeviceMemory_T"
+    },
+    {
+     "field_name" : "memoryOffset",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkBindDataGraphPipelineSessionMemoryInfoARM",
+   "name" : "VkBindDataGraphPipelineSessionMemoryInfoARM",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "pushOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "addressOffset",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkDescriptorMappingSourceIndirectAddressEXT",
+   "name" : "VkDescriptorMappingSourceIndirectAddressEXT",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -62734,6 +73035,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "cooperativeVector",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeVectorTraining",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkPhysicalDeviceCooperativeVectorFeaturesNV",
+   "name" : "VkPhysicalDeviceCooperativeVectorFeaturesNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -62836,6 +73166,120 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "samplerHeapAlignment",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "resourceHeapAlignment",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxSamplerHeapSize",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxResourceHeapSize",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "minSamplerHeapReservedRange",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "minSamplerHeapReservedRangeWithEmbedded",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "minResourceHeapReservedRange",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "samplerDescriptorSize",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "imageDescriptorSize",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "bufferDescriptorSize",
+     "field_offset" : 704,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "samplerDescriptorAlignment",
+     "field_offset" : 768,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "imageDescriptorAlignment",
+     "field_offset" : 832,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "bufferDescriptorAlignment",
+     "field_offset" : 896,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxPushDataSize",
+     "field_offset" : 960,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "imageCaptureReplayOpaqueDataSize",
+     "field_offset" : 1024,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxDescriptorHeapEmbeddedSamplers",
+     "field_offset" : 1088,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerYcbcrConversionCount",
+     "field_offset" : 1120,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "sparseDescriptorHeaps",
+     "field_offset" : 1152,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "protectedDescriptorHeaps",
+     "field_offset" : 1184,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkPhysicalDeviceDescriptorHeapPropertiesEXT",
+   "name" : "VkPhysicalDeviceDescriptorHeapPropertiesEXT",
+   "size" : 152,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -63092,6 +73536,30 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "longVector",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkPhysicalDeviceShaderLongVectorFeaturesEXT",
+   "name" : "VkPhysicalDeviceShaderLongVectorFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -63285,6 +73753,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "optimalImageTransferToQueueFamilies",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkQueueFamilyOwnershipTransferPropertiesKHR",
+   "name" : "VkQueueFamilyOwnershipTransferPropertiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -63362,6 +73854,69 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maxQuantizationMapExtent",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkVideoEncodeQuantizationMapCapabilitiesKHR",
+   "name" : "VkVideoEncodeQuantizationMapCapabilitiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "rgbModels",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "rgbRanges",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "xChromaOffsets",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "yChromaOffsets",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI43VkVideoEncodeRgbConversionCapabilitiesVALVE",
+   "name" : "VkVideoEncodeRgbConversionCapabilitiesVALVE",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -63391,6 +73946,173 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "vertexFormat",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI8VkFormat"
+    },
+    {
+     "field_name" : "vertexData",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI29VkDeviceOrHostAddressConstKHR"
+    },
+    {
+     "field_name" : "vertexStride",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "radiusFormat",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTI8VkFormat"
+    },
+    {
+     "field_name" : "radiusData",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTI29VkDeviceOrHostAddressConstKHR"
+    },
+    {
+     "field_name" : "radiusStride",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "indexType",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTI11VkIndexType"
+    },
+    {
+     "field_name" : "indexData",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTI29VkDeviceOrHostAddressConstKHR"
+    },
+    {
+     "field_name" : "indexStride",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkAccelerationStructureGeometrySpheresDataNV",
+   "name" : "VkAccelerationStructureGeometrySpheresDataNV",
+   "size" : 88,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "input",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI41VkClusterAccelerationStructureInputInfoNV"
+    },
+    {
+     "field_name" : "dstImplicitData",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "scratchData",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstAddressesArray",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTI31VkStridedDeviceAddressRegionKHR"
+    },
+    {
+     "field_name" : "dstSizesArray",
+     "field_offset" : 768,
+     "referenced_type" : "_ZTI31VkStridedDeviceAddressRegionKHR"
+    },
+    {
+     "field_name" : "srcInfosArray",
+     "field_offset" : 960,
+     "referenced_type" : "_ZTI31VkStridedDeviceAddressRegionKHR"
+    },
+    {
+     "field_name" : "srcInfosCount",
+     "field_offset" : 1152,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "addressResolutionFlags",
+     "field_offset" : 1216,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkClusterAccelerationStructureCommandsInfoNV",
+   "name" : "VkClusterAccelerationStructureCommandsInfoNV",
+   "size" : 160,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "module",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP16VkShaderModule_T"
+    },
+    {
+     "field_name" : "pName",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKc"
+    },
+    {
+     "field_name" : "pSpecializationInfo",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPK20VkSpecializationInfo"
+    },
+    {
+     "field_name" : "constantCount",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pConstants",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIPK30VkDataGraphPipelineConstantARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkDataGraphPipelineShaderModuleCreateInfoARM",
+   "name" : "VkDataGraphPipelineShaderModuleCreateInfoARM",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -63479,6 +74201,99 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "indirectExecutionSet",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP27VkIndirectExecutionSetEXT_T"
+    },
+    {
+     "field_name" : "indirectCommandsLayout",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIP29VkIndirectCommandsLayoutEXT_T"
+    },
+    {
+     "field_name" : "maxSequenceCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxDrawCount",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkGeneratedCommandsMemoryRequirementsInfoEXT",
+   "name" : "VkGeneratedCommandsMemoryRequirementsInfoEXT",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "cooperativeMatrixWorkgroupScope",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixFlexibleDimensions",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixReductions",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixConversions",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixPerElementOperations",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixTensorAddressing",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixBlockLoads",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceCooperativeMatrix2FeaturesNV",
+   "name" : "VkPhysicalDeviceCooperativeMatrix2FeaturesNV",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -63570,21 +74385,64 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "computeCapabilityMinor",
+     "field_name" : "customBorderColors",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "computeCapabilityMajor",
+     "field_name" : "customBorderColorWithoutFormat",
      "field_offset" : 160,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI44VkPhysicalDeviceCudaKernelLaunchPropertiesNV",
-   "name" : "VkPhysicalDeviceCudaKernelLaunchPropertiesNV",
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceCustomBorderColorFeaturesEXT",
+   "name" : "VkPhysicalDeviceCustomBorderColorFeaturesEXT",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "operationType",
+     "referenced_type" : "_ZTI41VkPhysicalDeviceDataGraphOperationTypeARM"
+    },
+    {
+     "field_name" : "name",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIA128_c"
+    },
+    {
+     "field_name" : "version",
+     "field_offset" : 1056,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceDataGraphOperationSupportARM",
+   "name" : "VkPhysicalDeviceDataGraphOperationSupportARM",
+   "size" : 136,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 4,
+   "fields" :
+   [
+    {
+     "field_name" : "type",
+     "referenced_type" : "_ZTI48VkPhysicalDeviceDataGraphProcessingEngineTypeARM"
+    },
+    {
+     "field_name" : "isForeign",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceDataGraphProcessingEngineARM",
+   "name" : "VkPhysicalDeviceDataGraphProcessingEngineARM",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -63599,18 +74457,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "customBorderColors",
+     "field_name" : "depthClampControl",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "customBorderColorWithoutFormat",
-     "field_offset" : 160,
-     "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI44VkPhysicalDeviceCustomBorderColorFeaturesEXT",
-   "name" : "VkPhysicalDeviceCustomBorderColorFeaturesEXT",
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceDepthClampControlFeaturesEXT",
+   "name" : "VkPhysicalDeviceDepthClampControlFeaturesEXT",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -63633,8 +74486,8 @@
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI44VkPhysicalDeviceDepthClampZeroOneFeaturesEXT",
-   "name" : "VkPhysicalDeviceDepthClampZeroOneFeaturesEXT",
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceDepthClampZeroOneFeaturesKHR",
+   "name" : "VkPhysicalDeviceDepthClampZeroOneFeaturesKHR",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -64033,6 +74886,45 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maxGraphicsPushConstantBanks",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxComputePushConstantBanks",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxGraphicsPushDataBanks",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxComputePushDataBanks",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkPhysicalDevicePushConstantBankPropertiesNV",
+   "name" : "VkPhysicalDevicePushConstantBankPropertiesNV",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -64402,6 +75294,35 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "queueSubmitBoundary",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "tileBufferTransfers",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceTileMemoryHeapPropertiesQCOM",
+   "name" : "VkPhysicalDeviceTileMemoryHeapPropertiesQCOM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -64455,6 +75376,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "videoMaintenance2",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkPhysicalDeviceVideoMaintenance2FeaturesKHR",
+   "name" : "VkPhysicalDeviceVideoMaintenance2FeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -64537,19 +75482,14 @@
      "referenced_type" : "_ZTIPKv"
     },
     {
-     "field_name" : "fragmentDensityOffsetCount",
+     "field_name" : "index",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
-    },
-    {
-     "field_name" : "pFragmentDensityOffsets",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIPK10VkOffset2D"
     }
    ],
-   "linker_set_key" : "_ZTI44VkSubpassFragmentDensityMapOffsetEndInfoQCOM",
-   "name" : "VkSubpassFragmentDensityMapOffsetEndInfoQCOM",
-   "size" : 32,
+   "linker_set_key" : "_ZTI44VkSamplerCustomBorderColorIndexCreateInfoEXT",
+   "name" : "VkSamplerCustomBorderColorIndexCreateInfoEXT",
+   "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -64816,6 +75756,30 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "compatibleSuperblockSizes",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI44VkVideoFormatAV1QuantizationMapPropertiesKHR",
+   "name" : "VkVideoFormatAV1QuantizationMapPropertiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -64931,6 +75895,138 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "input",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI50VkPartitionedAccelerationStructureInstancesInputNV"
+    },
+    {
+     "field_name" : "srcAccelerationStructureData",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "dstAccelerationStructureData",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "scratchData",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "srcInfos",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "srcInfosCount",
+     "field_offset" : 704,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkBuildPartitionedAccelerationStructureInfoNV",
+   "name" : "VkBuildPartitionedAccelerationStructureInfoNV",
+   "size" : 96,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pOperation",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK44VkPhysicalDeviceDataGraphOperationSupportARM"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkDataGraphPipelineBuiltinModelCreateInfoQCOM",
+   "name" : "VkDataGraphPipelineBuiltinModelCreateInfoQCOM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "heapOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "shaderRecordOffset",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapIndexStride",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapArrayStride",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pEmbeddedSampler",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK19VkSamplerCreateInfo"
+    },
+    {
+     "field_name" : "useCombinedImageSamplerIndex",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapOffset",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerShaderRecordOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapIndexStride",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapArrayStride",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkDescriptorMappingSourceShaderRecordIndexEXT",
+   "name" : "VkDescriptorMappingSourceShaderRecordIndexEXT",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -65042,6 +76138,74 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "cooperativeVectorSupportedStages",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeVectorTrainingFloat16Accumulation",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeVectorTrainingFloat32Accumulation",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxCooperativeVectorComponents",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkPhysicalDeviceCooperativeVectorPropertiesNV",
+   "name" : "VkPhysicalDeviceCooperativeVectorPropertiesNV",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "indirectMemoryCopy",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "indirectMemoryToImageCopy",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkPhysicalDeviceCopyMemoryIndirectFeaturesKHR",
+   "name" : "VkPhysicalDeviceCopyMemoryIndirectFeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -65449,30 +76613,6 @@
    "size" : 856,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
-    {
-     "field_name" : "sType",
-     "referenced_type" : "_ZTI15VkStructureType"
-    },
-    {
-     "field_name" : "pNext",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
-    },
-    {
-     "field_name" : "memoryDecompression",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTIj"
-    }
-   ],
-   "linker_set_key" : "_ZTI45VkPhysicalDeviceMemoryDecompressionFeaturesNV",
-   "name" : "VkPhysicalDeviceMemoryDecompressionFeaturesNV",
-   "size" : 24,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
   {
    "alignment" : 8,
    "fields" :
@@ -65745,6 +76885,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "maxVectorComponents",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkPhysicalDeviceShaderLongVectorPropertiesEXT",
+   "name" : "VkPhysicalDeviceShaderLongVectorPropertiesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -65896,6 +77060,59 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "mappingCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pMappings",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK35VkDescriptorSetAndBindingMappingEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkShaderDescriptorSetAndBindingMappingInfoEXT",
+   "name" : "VkShaderDescriptorSetAndBindingMappingInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "intraRefreshMode",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI40VkVideoEncodeIntraRefreshModeFlagBitsKHR"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkVideoEncodeSessionIntraRefreshCreateInfoKHR",
+   "name" : "VkVideoEncodeSessionIntraRefreshCreateInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -65920,6 +77137,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "compatibleCtbSizes",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI45VkVideoFormatH265QuantizationMapPropertiesKHR",
+   "name" : "VkVideoFormatH265QuantizationMapPropertiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -65979,6 +77220,65 @@
    "size" : 72,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_android.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "heapOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pushOffset",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "addressOffset",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "heapIndexStride",
+     "field_offset" : 96,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pEmbeddedSampler",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK19VkSamplerCreateInfo"
+    },
+    {
+     "field_name" : "useCombinedImageSamplerIndex",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapOffset",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerPushOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerAddressOffset",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "samplerHeapIndexStride",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkDescriptorMappingSourceIndirectIndexArrayEXT",
+   "name" : "VkDescriptorMappingSourceIndirectIndexArrayEXT",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66056,14 +77356,24 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "cooperativeMatrixSupportedStages",
+     "field_name" : "cooperativeMatrixWorkgroupScopeMaxWorkgroupSize",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixFlexibleDimensionsMaxDimension",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "cooperativeMatrixWorkgroupScopeReservedSharedMemory",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI46VkPhysicalDeviceCooperativeMatrixPropertiesKHR",
-   "name" : "VkPhysicalDeviceCooperativeMatrixPropertiesKHR",
-   "size" : 24,
+   "linker_set_key" : "_ZTI46VkPhysicalDeviceCooperativeMatrix2PropertiesNV",
+   "name" : "VkPhysicalDeviceCooperativeMatrix2PropertiesNV",
+   "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -66080,13 +77390,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "supportedQueues",
+     "field_name" : "cooperativeMatrixSupportedStages",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI46VkPhysicalDeviceCopyMemoryIndirectPropertiesNV",
-   "name" : "VkPhysicalDeviceCopyMemoryIndirectPropertiesNV",
+   "linker_set_key" : "_ZTI46VkPhysicalDeviceCooperativeMatrixPropertiesKHR",
+   "name" : "VkPhysicalDeviceCooperativeMatrixPropertiesKHR",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -66220,6 +77530,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "memoryDecompression",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkPhysicalDeviceMemoryDecompressionFeaturesEXT",
+   "name" : "VkPhysicalDeviceMemoryDecompressionFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66360,6 +77694,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "shader64BitIndexing",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkPhysicalDeviceShader64BitIndexingFeaturesEXT",
+   "name" : "VkPhysicalDeviceShader64BitIndexingFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66516,6 +77874,35 @@
    "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "unifiedImageLayouts",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "unifiedImageLayoutsVideo",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkPhysicalDeviceUnifiedImageLayoutsFeaturesKHR",
+   "name" : "VkPhysicalDeviceUnifiedImageLayoutsFeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66608,6 +77995,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "fragmentDensityOffsetCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pFragmentDensityOffsets",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK10VkOffset2D"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkRenderPassFragmentDensityMapOffsetEndInfoEXT",
+   "name" : "VkRenderPassFragmentDensityMapOffsetEndInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66637,6 +78053,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pStdSequenceHeader",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK25StdVideoAV1SequenceHeader"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkVideoDecodeAV1InlineSessionParametersInfoKHR",
+   "name" : "VkVideoDecodeAV1InlineSessionParametersInfoKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66661,6 +78101,74 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "minQIndexDelta",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "maxQIndexDelta",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkVideoEncodeAV1QuantizationMapCapabilitiesKHR",
+   "name" : "VkVideoEncodeAV1QuantizationMapCapabilitiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pStdSequenceHeader",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK25StdVideoAV1SequenceHeader"
+    },
+    {
+     "field_name" : "pStdDecoderModelInfo",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK33StdVideoEncodeAV1DecoderModelInfo"
+    },
+    {
+     "field_name" : "stdOperatingPointCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pStdOperatingPoints",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPK35StdVideoEncodeAV1OperatingPointInfo"
+    }
+   ],
+   "linker_set_key" : "_ZTI46VkVideoEncodeAV1SessionParametersCreateInfoKHR",
+   "name" : "VkVideoEncodeAV1SessionParametersCreateInfoKHR",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66832,6 +78340,49 @@
    "size" : 72,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_android.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "srcAccelerationStructure",
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkClusterAccelerationStructureMoveObjectsInfoNV",
+   "name" : "VkClusterAccelerationStructureMoveObjectsInfoNV",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pSamplerHeapBindInfo",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK17VkBindHeapInfoEXT"
+    },
+    {
+     "field_name" : "pResourceHeapBindInfo",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK17VkBindHeapInfoEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkCommandBufferInheritanceDescriptorHeapInfoEXT",
+   "name" : "VkCommandBufferInheritanceDescriptorHeapInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66866,6 +78417,30 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pVendorOptions",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPKc"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkDataGraphPipelineCompilerControlCreateInfoARM",
+   "name" : "VkDataGraphPipelineCompilerControlCreateInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -66919,6 +78494,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "supportedQueues",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkPhysicalDeviceCopyMemoryIndirectPropertiesKHR",
+   "name" : "VkPhysicalDeviceCopyMemoryIndirectPropertiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -67049,35 +78648,6 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
-    {
-     "field_name" : "sType",
-     "referenced_type" : "_ZTI15VkStructureType"
-    },
-    {
-     "field_name" : "pNext",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
-    },
-    {
-     "field_name" : "decompressionMethods",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTIm"
-    },
-    {
-     "field_name" : "maxDecompressionIndirectCount",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIm"
-    }
-   ],
-   "linker_set_key" : "_ZTI47VkPhysicalDeviceMemoryDecompressionPropertiesNV",
-   "name" : "VkPhysicalDeviceMemoryDecompressionPropertiesNV",
-   "size" : 32,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
   {
    "alignment" : 8,
    "fields" :
@@ -67436,6 +79006,35 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pStdSPS",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK32StdVideoH264SequenceParameterSet"
+    },
+    {
+     "field_name" : "pStdPPS",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK31StdVideoH264PictureParameterSet"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkVideoDecodeH264InlineSessionParametersInfoKHR",
+   "name" : "VkVideoDecodeH264InlineSessionParametersInfoKHR",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -67470,6 +79069,40 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "pStdVPS",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIPK29StdVideoH265VideoParameterSet"
+    },
+    {
+     "field_name" : "pStdSPS",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK32StdVideoH265SequenceParameterSet"
+    },
+    {
+     "field_name" : "pStdPPS",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIPK31StdVideoH265PictureParameterSet"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkVideoDecodeH265InlineSessionParametersInfoKHR",
+   "name" : "VkVideoDecodeH265InlineSessionParametersInfoKHR",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -67509,6 +79142,35 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "minQpDelta",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "maxQpDelta",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkVideoEncodeH264QuantizationMapCapabilitiesKHR",
+   "name" : "VkVideoEncodeH264QuantizationMapCapabilitiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -67543,6 +79205,35 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "minQpDelta",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIi"
+    },
+    {
+     "field_name" : "maxQpDelta",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIi"
+    }
+   ],
+   "linker_set_key" : "_ZTI47VkVideoEncodeH265QuantizationMapCapabilitiesKHR",
+   "name" : "VkVideoEncodeH265QuantizationMapCapabilitiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -67582,6 +79273,40 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "type",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI36VkClusterAccelerationStructureTypeNV"
+    },
+    {
+     "field_name" : "noMoveOverlap",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxMovedBytes",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI48VkClusterAccelerationStructureMoveObjectsInputNV",
+   "name" : "VkClusterAccelerationStructureMoveObjectsInputNV",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -67834,6 +79559,35 @@
    "size" : 144,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "externalDataSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxExternalQueues",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI48VkPhysicalDeviceExternalComputeQueuePropertiesNV",
+   "name" : "VkPhysicalDeviceExternalComputeQueuePropertiesNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -67977,6 +79731,35 @@
    "size" : 96,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "decompressionMethods",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "maxDecompressionIndirectCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI48VkPhysicalDeviceMemoryDecompressionPropertiesEXT",
+   "name" : "VkPhysicalDeviceMemoryDecompressionPropertiesEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -68025,6 +79808,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "shaderUntypedPointers",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI48VkPhysicalDeviceShaderUntypedPointersFeaturesKHR",
+   "name" : "VkPhysicalDeviceShaderUntypedPointersFeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -68044,8 +79851,8 @@
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI48VkPhysicalDeviceSwapchainMaintenance1FeaturesEXT",
-   "name" : "VkPhysicalDeviceSwapchainMaintenance1FeaturesEXT",
+   "linker_set_key" : "_ZTI48VkPhysicalDeviceSwapchainMaintenance1FeaturesKHR",
+   "name" : "VkPhysicalDeviceSwapchainMaintenance1FeaturesKHR",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -68102,6 +79909,177 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "depthClampMode",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI19VkDepthClampModeEXT"
+    },
+    {
+     "field_name" : "pDepthClampRange",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPK20VkDepthClampRangeEXT"
+    }
+   ],
+   "linker_set_key" : "_ZTI48VkPipelineViewportDepthClampControlCreateInfoEXT",
+   "name" : "VkPipelineViewportDepthClampControlCreateInfoEXT",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "rgbModel",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI44VkVideoEncodeRgbModelConversionFlagBitsVALVE"
+    },
+    {
+     "field_name" : "rgbRange",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI45VkVideoEncodeRgbRangeCompressionFlagBitsVALVE"
+    },
+    {
+     "field_name" : "xChromaOffset",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI41VkVideoEncodeRgbChromaOffsetFlagBitsVALVE"
+    },
+    {
+     "field_name" : "yChromaOffset",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTI41VkVideoEncodeRgbChromaOffsetFlagBitsVALVE"
+    }
+   ],
+   "linker_set_key" : "_ZTI48VkVideoEncodeSessionRgbConversionCreateInfoVALVE",
+   "name" : "VkVideoEncodeSessionRgbConversionCreateInfoVALVE",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "MGranularity",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "NGranularity",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "KGranularity",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "AType",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "BType",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "CType",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "ResultType",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTI18VkComponentTypeKHR"
+    },
+    {
+     "field_name" : "saturatingAccumulation",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "scope",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTI10VkScopeKHR"
+    },
+    {
+     "field_name" : "workgroupInvocations",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI49VkCooperativeMatrixFlexibleDimensionsPropertiesNV",
+   "name" : "VkCooperativeMatrixFlexibleDimensionsPropertiesNV",
+   "size" : 56,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "bindPoint",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI38VkDataGraphPipelineSessionBindPointARM"
+    },
+    {
+     "field_name" : "bindPointType",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTI42VkDataGraphPipelineSessionBindPointTypeARM"
+    },
+    {
+     "field_name" : "numObjects",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI49VkDataGraphPipelineSessionBindPointRequirementARM",
+   "name" : "VkDataGraphPipelineSessionBindPointRequirementARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -68126,6 +80104,64 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "descriptorBufferTensorDescriptors",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI49VkPhysicalDeviceDescriptorBufferTensorFeaturesARM",
+   "name" : "VkPhysicalDeviceDescriptorBufferTensorFeaturesARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "tensorDescriptorSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "tensorDescriptorAlignment",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "tensorCaptureReplayOpaqueDataSize",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI49VkPhysicalDeviceDescriptorHeapTensorPropertiesARM",
+   "name" : "VkPhysicalDeviceDescriptorHeapTensorPropertiesARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -68749,6 +80785,50 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "flags",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "instanceCount",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxInstancePerPartitionCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "partitionCount",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxInstanceInGlobalPartitionCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI50VkPartitionedAccelerationStructureInstancesInputNV",
+   "name" : "VkPartitionedAccelerationStructureInstancesInputNV",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -68875,18 +80955,42 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "computeDerivativeGroupQuads",
+     "field_name" : "computeOccupancyPriority",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI50VkPhysicalDeviceComputeOccupancyPriorityFeaturesNV",
+   "name" : "VkPhysicalDeviceComputeOccupancyPriorityFeaturesNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
     },
     {
-     "field_name" : "computeDerivativeGroupLinear",
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "deviceGeneratedCommands",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "dynamicGeneratedPipelineLayout",
      "field_offset" : 160,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI50VkPhysicalDeviceComputeShaderDerivativesFeaturesNV",
-   "name" : "VkPhysicalDeviceComputeShaderDerivativesFeaturesNV",
+   "linker_set_key" : "_ZTI50VkPhysicalDeviceDeviceGeneratedCommandsFeaturesEXT",
+   "name" : "VkPhysicalDeviceDeviceGeneratedCommandsFeaturesEXT",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -69054,6 +81158,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "pipelineOpacityMicromap",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI50VkPhysicalDevicePipelineOpacityMicromapFeaturesARM",
+   "name" : "VkPhysicalDevicePipelineOpacityMicromapFeaturesARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69102,6 +81230,54 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "videoEncodeIntraRefresh",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI50VkPhysicalDeviceVideoEncodeIntraRefreshFeaturesKHR",
+   "name" : "VkPhysicalDeviceVideoEncodeIntraRefreshFeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "maxFragmentDensityMapLayers",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI50VkPipelineFragmentDensityMapLayeredCreateInfoVALVE",
+   "name" : "VkPipelineFragmentDensityMapLayeredCreateInfoVALVE",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69252,6 +81428,40 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "session",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP31VkDataGraphPipelineSessionARM_T"
+    },
+    {
+     "field_name" : "bindPoint",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI38VkDataGraphPipelineSessionBindPointARM"
+    },
+    {
+     "field_name" : "objectIndex",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI51VkDataGraphPipelineSessionMemoryRequirementsInfoARM",
+   "name" : "VkDataGraphPipelineSessionMemoryRequirementsInfoARM",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69325,6 +81535,69 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "computeDerivativeGroupQuads",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "computeDerivativeGroupLinear",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI51VkPhysicalDeviceComputeShaderDerivativesFeaturesKHR",
+   "name" : "VkPhysicalDeviceComputeShaderDerivativesFeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "tensorCaptureReplayDescriptorDataSize",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "tensorViewCaptureReplayDescriptorDataSize",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "tensorDescriptorSize",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI51VkPhysicalDeviceDescriptorBufferTensorPropertiesARM",
+   "name" : "VkPhysicalDeviceDescriptorBufferTensorPropertiesARM",
+   "size" : 40,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69389,6 +81662,30 @@
    "size" : 56,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "fragmentDensityMapOffset",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI51VkPhysicalDeviceFragmentDensityMapOffsetFeaturesEXT",
+   "name" : "VkPhysicalDeviceFragmentDensityMapOffsetFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69591,6 +81888,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "textureCompressionASTC_3D",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI51VkPhysicalDeviceTextureCompressionASTC3DFeaturesEXT",
+   "name" : "VkPhysicalDeviceTextureCompressionASTC3DFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69650,7 +81971,7 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
+     "referenced_type" : "_ZTIPKv"
     },
     {
      "field_name" : "requiredSubgroupSize",
@@ -69726,6 +82047,79 @@
    "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "foreignSemaphoreHandleTypes",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "foreignMemoryHandleTypes",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI51VkQueueFamilyDataGraphProcessingEnginePropertiesARM",
+   "name" : "VkQueueFamilyDataGraphProcessingEnginePropertiesARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "counterAddressCount",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pCounterAddresses",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKm"
+    },
+    {
+     "field_name" : "serializeRegions",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "counterIndexCount",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pCounterIndices",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIPj"
+    }
+   ],
+   "linker_set_key" : "_ZTI51VkRenderPassPerformanceCountersByRegionBeginInfoARM",
+   "name" : "VkRenderPassPerformanceCountersByRegionBeginInfoARM",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69750,6 +82144,65 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "vertexFormat",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI8VkFormat"
+    },
+    {
+     "field_name" : "maxGeometryIndexValue",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxClusterUniqueGeometryCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxClusterTriangleCount",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxClusterVertexCount",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxTotalTriangleCount",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxTotalVertexCount",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "minPositionTruncateBitCount",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI52VkClusterAccelerationStructureTriangleClusterInputNV",
+   "name" : "VkClusterAccelerationStructureTriangleClusterInputNV",
+   "size" : 48,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -69832,14 +82285,69 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "extendedSparseAddressSpace",
+     "field_name" : "maxIndirectPipelineCount",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxIndirectShaderObjectCount",
+     "field_offset" : 160,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxIndirectSequenceCount",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxIndirectCommandsTokenCount",
+     "field_offset" : 224,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxIndirectCommandsTokenOffset",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "maxIndirectCommandsIndirectStride",
+     "field_offset" : 288,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "supportedIndirectCommandsInputModes",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "supportedIndirectCommandsShaderStages",
+     "field_offset" : 352,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "supportedIndirectCommandsShaderStagesPipelineBinding",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "supportedIndirectCommandsShaderStagesShaderBinding",
+     "field_offset" : 416,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "deviceGeneratedCommandsTransformFeedback",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "deviceGeneratedCommandsMultiDrawIndirectCount",
+     "field_offset" : 480,
+     "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI52VkPhysicalDeviceExtendedSparseAddressSpaceFeaturesNV",
-   "name" : "VkPhysicalDeviceExtendedSparseAddressSpaceFeaturesNV",
-   "size" : 24,
+   "linker_set_key" : "_ZTI52VkPhysicalDeviceDeviceGeneratedCommandsPropertiesEXT",
+   "name" : "VkPhysicalDeviceDeviceGeneratedCommandsPropertiesEXT",
+   "size" : 64,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -69856,15 +82364,15 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "externalFormatResolve",
+     "field_name" : "extendedSparseAddressSpace",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI52VkPhysicalDeviceExternalFormatResolveFeaturesANDROID",
-   "name" : "VkPhysicalDeviceExternalFormatResolveFeaturesANDROID",
+   "linker_set_key" : "_ZTI52VkPhysicalDeviceExtendedSparseAddressSpaceFeaturesNV",
+   "name" : "VkPhysicalDeviceExtendedSparseAddressSpaceFeaturesNV",
    "size" : 24,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_android.h"
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
    "alignment" : 8,
@@ -69880,15 +82388,15 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "fragmentDensityMapOffset",
+     "field_name" : "externalFormatResolve",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI52VkPhysicalDeviceFragmentDensityMapOffsetFeaturesQCOM",
-   "name" : "VkPhysicalDeviceFragmentDensityMapOffsetFeaturesQCOM",
+   "linker_set_key" : "_ZTI52VkPhysicalDeviceExternalFormatResolveFeaturesANDROID",
+   "name" : "VkPhysicalDeviceExternalFormatResolveFeaturesANDROID",
    "size" : 24,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_android.h"
   },
   {
    "alignment" : 8,
@@ -70063,6 +82571,54 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "shaderSubgroupPartitioned",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI52VkPhysicalDeviceShaderSubgroupPartitionedFeaturesEXT",
+   "name" : "VkPhysicalDeviceShaderSubgroupPartitionedFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "vertexAttributeRobustness",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI52VkPhysicalDeviceVertexAttributeRobustnessFeaturesEXT",
+   "name" : "VkPhysicalDeviceVertexAttributeRobustnessFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70156,7 +82712,7 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
+     "referenced_type" : "_ZTIPKv"
     },
     {
      "field_name" : "transform",
@@ -70174,6 +82730,60 @@
    "size" : 40,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "transform",
+     "referenced_type" : "_ZTI20VkTransformMatrixKHR"
+    },
+    {
+     "field_name" : "explicitAABB",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTIA6_f"
+    },
+    {
+     "field_name" : "instanceID",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "instanceMask",
+     "field_offset" : 608,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "instanceContributionToHitGroupIndex",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "instanceFlags",
+     "field_offset" : 672,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "instanceIndex",
+     "field_offset" : 704,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "partitionIndex",
+     "field_offset" : 736,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "accelerationStructure",
+     "field_offset" : 768,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI53VkPartitionedAccelerationStructureWriteInstanceDataNV",
+   "name" : "VkPartitionedAccelerationStructureWriteInstanceDataNV",
+   "size" : 104,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70198,6 +82808,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "meshAndTaskShaderDerivatives",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI53VkPhysicalDeviceComputeShaderDerivativesPropertiesKHR",
+   "name" : "VkPhysicalDeviceComputeShaderDerivativesPropertiesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70222,6 +82856,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "fragmentDensityOffsetGranularity",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI10VkExtent2D"
+    }
+   ],
+   "linker_set_key" : "_ZTI53VkPhysicalDeviceFragmentDensityMapOffsetPropertiesEXT",
+   "name" : "VkPhysicalDeviceFragmentDensityMapOffsetPropertiesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70246,6 +82904,30 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "presentModeFifoLatestReady",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI53VkPhysicalDevicePresentModeFifoLatestReadyFeaturesKHR",
+   "name" : "VkPhysicalDevicePresentModeFifoLatestReadyFeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70318,6 +83000,78 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "videoEncodeQuantizationMap",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI53VkPhysicalDeviceVideoEncodeQuantizationMapFeaturesKHR",
+   "name" : "VkPhysicalDeviceVideoEncodeQuantizationMapFeaturesKHR",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "videoEncodeRgbConversion",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI53VkPhysicalDeviceVideoEncodeRgbConversionFeaturesVALVE",
+   "name" : "VkPhysicalDeviceVideoEncodeRgbConversionFeaturesVALVE",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "zeroInitializeDeviceMemory",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI53VkPhysicalDeviceZeroInitializeDeviceMemoryFeaturesEXT",
+   "name" : "VkPhysicalDeviceZeroInitializeDeviceMemoryFeaturesEXT",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70400,6 +83154,82 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "clusterTemplateAddress",
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI54VkClusterAccelerationStructureGetTemplateIndicesInfoNV",
+   "name" : "VkClusterAccelerationStructureGetTemplateIndicesInfoNV",
+   "size" : 8,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "clusterIdOffset",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 24,
+     "field_name" : "geometryIndexOffset",
+     "field_offset" : 32,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "bit_width" : 8,
+     "field_name" : "reserved",
+     "field_offset" : 56,
+     "is_bit_field" : true,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "clusterTemplateAddress",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    },
+    {
+     "field_name" : "vertexBuffer",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTI24VkStridedDeviceAddressNV"
+    }
+   ],
+   "linker_set_key" : "_ZTI54VkClusterAccelerationStructureInstantiateClusterInfoNV",
+   "name" : "VkClusterAccelerationStructureInstantiateClusterInfoNV",
+   "size" : 32,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPKv"
+    },
+    {
+     "field_name" : "session",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIP31VkDataGraphPipelineSessionARM_T"
+    }
+   ],
+   "linker_set_key" : "_ZTI54VkDataGraphPipelineSessionBindPointRequirementsInfoARM",
+   "name" : "VkDataGraphPipelineSessionBindPointRequirementsInfoARM",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70424,6 +83254,54 @@
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "instanceIndex",
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "instanceContributionToHitGroupIndex",
+     "field_offset" : 32,
+     "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "accelerationStructure",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIm"
+    }
+   ],
+   "linker_set_key" : "_ZTI54VkPartitionedAccelerationStructureUpdateInstanceDataNV",
+   "name" : "VkPartitionedAccelerationStructureUpdateInstanceDataNV",
+   "size" : 16,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
+  {
+   "alignment" : 8,
+   "fields" :
+   [
+    {
+     "field_name" : "sType",
+     "referenced_type" : "_ZTI15VkStructureType"
+    },
+    {
+     "field_name" : "pNext",
+     "field_offset" : 64,
+     "referenced_type" : "_ZTIPv"
+    },
+    {
+     "field_name" : "clusterAccelerationStructure",
+     "field_offset" : 128,
+     "referenced_type" : "_ZTIj"
+    }
+   ],
+   "linker_set_key" : "_ZTI54VkPhysicalDeviceClusterAccelerationStructureFeaturesNV",
+   "name" : "VkPhysicalDeviceClusterAccelerationStructureFeaturesNV",
+   "size" : 24,
+   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
+  },
   {
    "alignment" : 8,
    "fields" :
@@ -70594,13 +83472,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "fragmentDensityOffsetGranularity",
+     "field_name" : "fragmentDensityMapLayered",
      "field_offset" : 128,
-     "referenced_type" : "_ZTI10VkExtent2D"
+     "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI54VkPhysicalDeviceFragmentDensityMapOffsetPropertiesQCOM",
-   "name" : "VkPhysicalDeviceFragmentDensityMapOffsetPropertiesQCOM",
+   "linker_set_key" : "_ZTI54VkPhysicalDeviceFragmentDensityMapLayeredFeaturesVALVE",
+   "name" : "VkPhysicalDeviceFragmentDensityMapLayeredFeaturesVALVE",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -70642,13 +83520,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "pipelineLibraryGroupHandles",
+     "field_name" : "performanceCountersByRegion",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI54VkPhysicalDevicePipelineLibraryGroupHandlesFeaturesEXT",
-   "name" : "VkPhysicalDevicePipelineLibraryGroupHandlesFeaturesEXT",
+   "linker_set_key" : "_ZTI54VkPhysicalDevicePerformanceCountersByRegionFeaturesARM",
+   "name" : "VkPhysicalDevicePerformanceCountersByRegionFeaturesARM",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -70666,13 +83544,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "shaderDemoteToHelperInvocation",
+     "field_name" : "pipelineLibraryGroupHandles",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI54VkPhysicalDeviceShaderDemoteToHelperInvocationFeatures",
-   "name" : "VkPhysicalDeviceShaderDemoteToHelperInvocationFeatures",
+   "linker_set_key" : "_ZTI54VkPhysicalDevicePipelineLibraryGroupHandlesFeaturesEXT",
+   "name" : "VkPhysicalDevicePipelineLibraryGroupHandlesFeaturesEXT",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -70690,13 +83568,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "attachmentFeedbackLoopLayout",
+     "field_name" : "rayTracingInvocationReorder",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI55VkPhysicalDeviceAttachmentFeedbackLoopLayoutFeaturesEXT",
-   "name" : "VkPhysicalDeviceAttachmentFeedbackLoopLayoutFeaturesEXT",
+   "linker_set_key" : "_ZTI54VkPhysicalDeviceRayTracingInvocationReorderFeaturesEXT",
+   "name" : "VkPhysicalDeviceRayTracingInvocationReorderFeaturesEXT",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -70714,37 +83592,18 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "combinedImageSamplerDensityMapDescriptorSize",
+     "field_name" : "spheres",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIm"
-    }
-   ],
-   "linker_set_key" : "_ZTI55VkPhysicalDeviceDescriptorBufferDensityMapPropertiesEXT",
-   "name" : "VkPhysicalDeviceDescriptorBufferDensityMapPropertiesEXT",
-   "size" : 24,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
-    {
-     "field_name" : "sType",
-     "referenced_type" : "_ZTI15VkStructureType"
-    },
-    {
-     "field_name" : "pNext",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
+     "referenced_type" : "_ZTIj"
     },
     {
-     "field_name" : "perViewPositionAllComponents",
-     "field_offset" : 128,
+     "field_name" : "linearSweptSpheres",
+     "field_offset" : 160,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI55VkPhysicalDeviceMultiviewPerViewAttributesPropertiesNVX",
-   "name" : "VkPhysicalDeviceMultiviewPerViewAttributesPropertiesNVX",
+   "linker_set_key" : "_ZTI54VkPhysicalDeviceRayTracingLinearSweptSpheresFeaturesNV",
+   "name" : "VkPhysicalDeviceRayTracingLinearSweptSpheresFeaturesNV",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -70762,13 +83621,13 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "multiviewPerViewRenderAreas",
+     "field_name" : "shaderDemoteToHelperInvocation",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
     }
    ],
-   "linker_set_key" : "_ZTI55VkPhysicalDeviceMultiviewPerViewRenderAreasFeaturesQCOM",
-   "name" : "VkPhysicalDeviceMultiviewPerViewRenderAreasFeaturesQCOM",
+   "linker_set_key" : "_ZTI54VkPhysicalDeviceShaderDemoteToHelperInvocationFeatures",
+   "name" : "VkPhysicalDeviceShaderDemoteToHelperInvocationFeatures",
    "size" : 24,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
@@ -70786,14 +83645,19 @@
      "referenced_type" : "_ZTIPv"
     },
     {
-     "field_name" : "pipelineExecutableInfo",
+     "field_name" : "accelerationStructureCount",
      "field_offset" : 128,
      "referenced_type" : "_ZTIj"
+    },
+    {
+     "field_name" : "pAccelerationStructures",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTIPKm"
     }
    ],
-   "linker_set_key" : "_ZTI55VkPhysicalDevicePipelineExecutablePropertiesFeaturesKHR",
-   "name" : "VkPhysicalDevicePipelineExecutablePropertiesFeaturesKHR",
-   "size" : 24,
+   "linker_set_key" : "_ZTI54VkWriteDescriptorSetPartitionedAccelerationStructureNV",
+   "name" : "VkWriteDescriptorSetPartitionedAccelerationStructureNV",
+   "size" : 32,
    "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
   },
   {
@@ -70807,80 +83671,67 @@
     {
      "field_name" : "pNext",
      "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
+     "referenced_type" : "_ZTIPKv"
     },
     {
-     "field_name" : "primitiveTopologyListRestart",
+     "field_name" : "vertexFormat",
      "field_offset" : 128,
-     "referenced_type" : "_ZTIj"
+     "referenced_type" : "_ZTI8VkFormat"
     },
     {
-     "field_name" : "primitiveTopologyPatchListRestart",
-     "field_offset" : 160,
-     "referenced_type" : "_ZTIj"
-    }
-   ],
-   "linker_set_key" : "_ZTI55VkPhysicalDevicePrimitiveTopologyListRestartFeaturesEXT",
-   "name" : "VkPhysicalDevicePrimitiveTopologyListRestartFeaturesEXT",
-   "size" : 24,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
+     "field_name" : "vertexData",
+     "field_offset" : 192,
+     "referenced_type" : "_ZTI29VkDeviceOrHostAddressConstKHR"
+    },
     {
-     "field_name" : "sType",
-     "referenced_type" : "_ZTI15VkStructureType"
+     "field_name" : "vertexStride",
+     "field_offset" : 256,
+     "referenced_type" : "_ZTIm"
     },
     {
-     "field_name" : "pNext",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
+     "field_name" : "radiusFormat",
+     "field_offset" : 320,
+     "referenced_type" : "_ZTI8VkFormat"
     },
     {
-     "field_name" : "rayTracingInvocationReorderReorderingHint",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTI35VkRayTracingInvocationReorderModeNV"
-    }
-   ],
-   "linker_set_key" : "_ZTI55VkPhysicalDeviceRayTracingInvocationReorderPropertiesNV",
-   "name" : "VkPhysicalDeviceRayTracingInvocationReorderPropertiesNV",
-   "size" : 24,
-   "source_file" : "external/vulkan-headers/include/vulkan/vulkan_core.h"
-  },
-  {
-   "alignment" : 8,
-   "fields" :
-   [
+     "field_name" : "radiusData",
+     "field_offset" : 384,
+     "referenced_type" : "_ZTI29VkDeviceOrHostAddressConstKHR"
+    },
     {
-     "field_name" : "sType",
-     "referenced_type" : "_ZTI15VkStructureType"
+     "field_name" : "radiusStride",
+     "field_offset" : 448,
+     "referenced_type" : "_ZTIm"
     },
     {
-     "field_name" : "pNext",
-     "field_offset" : 64,
-     "referenced_type" : "_ZTIPv"
+     "field_name" : "indexType",
+     "field_offset" : 512,
+     "referenced_type" : "_ZTI11VkIndexType"
     },
     {
-     "field_name" : "deviceGeneratedCompute",
-     "field_offset" : 128,
-     "referenced_type" : "_ZTIj"
+     "field_name" : "indexData",
+     "field_offset" : 576,
+     "referenced_type" : "_ZTI29VkDeviceOrHostAddressConstKHR"
     },
     {
-     "field_name" : "deviceGeneratedComputePipelines",
-     "field_offset" : 160,
-     "referenced_type" : "_ZTIj"
+     "field_name" : "indexStride",
+     "field_offset" : 640,
+     "referenced_type" : "_ZTIm"
     },
     {
-     "field_name" : "deviceGeneratedComputeCaptureReplay",
-     "field_offset" : 192,
-     "referenced_type" : "_ZTIj"
+     "field_name" : "indexingMode",
